{"sessions":[{"id":"725439","title":"Re-Capturing the Hacking Spirit: Let’s Not Be Normal.  ","description":"This industry has changed a lot since I first started several decades ago. From garages and basements, we’ve climbed into skyscrapers and some of the largest companies in the world. We’ve seen new trends hit – ones that hit the industry different and ones that fizzled out. The industry of course is an industry with billions of dollars invested into the betterment (and vaporware) of understanding how to best build a defense. Our focus has shifted on doing what the industry tells us to advance in, however – this has limited our ability to be weird, have fun, and most importantly explore what makes this industry truly unique: our creativity and doing things differently. Let’s get back to weird, let’s get back to our roots, and pave a new way forward for the better.","startsAt":"2024-10-22T09:30:00","endsAt":"2024-10-22T10:30:00","isServiceSession":false,"isPlenumSession":true,"speakers":["00c7e8e9-e1ba-4c5a-815f-bacab3a8406b"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"699442","title":"The Game of Cybersecurity","description":"Why is it essential to employ an adversarial mindset as a cybersecurity professional? Understanding how and why threat actors do what they do in the ever-evolving digital landscape can help prioritize defenses against realistic threats. In other words, utilizing the adversarial mindset allows us to define the “game” we are actively playing as cybersecurity professionals. Although viewing security as a game may downplay the criticality of the profession, it serves a valuable purpose. Throughout this talk, we will explore the game of cybersecurity, the adversarial mindset, how each concept relates to security, how these mindsets can break down through biases, and why it’s essential to the security industry and others we routinely interact with. Let’s talk about the adversarial mindset and the game of cybersecurity.","startsAt":"2024-10-22T10:30:00","endsAt":"2024-10-22T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["9d174eea-e362-42f4-be82-9673781330e0"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"699604","title":"Compiling Resilience: How to Prevent Ourselves from Being Cybersecurity's Weakest Link","description":"The presentation is about how burnout and human error increase cybersecurity risks and offers practical strategies for individuals and organizations to create supportive environments that enhance security and well-being.","startsAt":"2024-10-22T10:30:00","endsAt":"2024-10-22T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["81608789-ffc1-4156-b4ef-14108c90a14b"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"698935","title":"From Bait to Breach: Understanding and Interrupting the Spear Phishing Kill Chain","description":"A purple-team-style after-action review of a recent real-world spear phishing campaign. Phishing is the most common form of cyber attack, with spear phishing emerging as a particularly insidious threat. Understanding the anatomy of spear phishing campaigns will enable defenders to identify and prevent attacks. \r\n\r\nDuring this session, attendees will demystify spear phishing attacks by examining how the spear phishing kill chain is used in actual engagements. Participants will gain a comprehensive understanding of each phase of the kill chain, from initial research to the final retrieval of sensitive data.\r\n\r\nWhile walking through these real-world scenarios, we will highlight opportunities for defenders to detect and thwart spear phishing attacks. This session isn't just about identifying the steps an attacker takes—it's about empowering the blue team to recognize vulnerabilities and implement strategies that interrupt the attack chain effectively.","startsAt":"2024-10-22T10:30:00","endsAt":"2024-10-22T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["8e4aad55-4780-44a4-a387-176ca2a9505d"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"746261","title":"K12 Password Best Practices","description":"In today's K-12 educational environments, achieving the delicate balance between security and usability in password management presents a significant challenge. Let's explore current practices in managing password security within the k12 school environment, discussing what's successful, the pain points and limitations of existing systems. \r\n\r\nWe will share innovative strategies and tools that can enhance security without compromising usability, including password management solutions tailored for educational settings, user education initiatives, and alternative authentication methods. Join us as we brainstorm actionable steps towards a more secure yet accessible digital environment for our students and educators.","startsAt":"2024-10-22T10:30:00","endsAt":"2024-10-22T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["4962c66a-adde-4323-953f-a0696f607acb"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"699611","title":"Walking the Tightrope: Balanced AI Risk Management","description":"It's hard to believe that it's been almost 2 years since ChatGPT was unleashed on the world and the subsequent wave of AI applications. It seems like almost every company has a strong opinion on AI - for better or worse though, it's here to stay.\r\n\r\nOperating under this assumption, what can we do to safely navigate the current environment where everything seems to be AI-driven? Come and discuss your thoughts, opinions, and experiences while we consider AI governance, resources to assess AI risk, and related compliance concerns and observations.","startsAt":"2024-10-22T11:00:00","endsAt":"2024-10-22T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["6b84fa55-e332-49a9-ba9c-aa4b7b5472bc"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"699141","title":"Breaking into CyberSecurity","description":"During COVID being uncertain about my future, having a college degree that wasn't paying dividends, and a lackluster career in sales and marketing I was introduced to a family friend who has been in the security industry for a couple of decades. He talked to me about a career in security and convinced me he could guide me to starting a new career - a real one capable of providing for myself and a family and building a future that didn't seem possible at the time. I trusted him, took action, and nearly four years later have been a security analyst for nearly 2 years and have a bright outlook ahead. I'd like to give a talk to show others how they might do the same and what I found to be pivotal in my road to breaking into cybersecurity!  ","startsAt":"2024-10-22T11:00:00","endsAt":"2024-10-22T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["e06b4e43-5e69-4d5e-ac91-12a0580b97f5"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"698154","title":"Roll for Initiative: Bringing table top RPGs to your Table Top exercises","description":"30 minute version of other submitted session\r\nIR TTX can become overly burdensome to stakeholders in part due to repetitiveness, and lack of interaction during exersice.   Learn how to make TTX scenarios exciting and interactive by leveraging RPG rulesets tailored to Incident response including \"Oh Noes!\" by Expel, and Dungeons & Data by Josh Bressers.  Get a chance to walkthrough a recent TTX utilizing the Dungeons & Data rules, allowing attendees to walk away with new ideas and ways to approach Incident Response Table Top exercises","startsAt":"2024-10-22T11:00:00","endsAt":"2024-10-22T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["91d62c8f-d6b0-4903-84f0-b37d362962da"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"699555","title":"Navigating the HPH Cybersecurity Performance Goals","description":"An overview of how a public-private partnership resulted in HHS publishing Cybersecurity Performance Goals (CPGs) for the Healthcare and Public Health (HPH) critical infrastructure sector, and a preview of upcoming regulatory mandatory requirements, incentives and penalties.","startsAt":"2024-10-22T11:30:00","endsAt":"2024-10-22T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["9f2aed4a-d871-4ed0-a39e-b412147284b1"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"720673","title":"SOC 2 = Good Security. I dare you to disagree!","description":"We all laugh and joke about SOC 2 being either called a \"certification' or referred to as an indicator of \"good security' but maybe in reality it actually is? We'll discuss why this statement is actually true and more importantly how we can build off of SOC 2 as the foundation for a strong and mature security program.","startsAt":"2024-10-22T11:30:00","endsAt":"2024-10-22T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["62d4d1ea-9166-40ea-a212-b073f5dc4b17"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"698055","title":"From Talking to Teaching: Reduce friction to increase the impact and utility of technical trainings","description":"In today’s rapidly evolving technological landscape, effective employee training is essential for maintaining the knowledge necessary to secure our world. However, many businesses encounter unintentional friction in their training processes, preventing employees from effectively learning and applying new skills to meet critical business objectives. This talk will delve into both technical and pedagogical strategies to minimize friction during training, making the training process more efficient, engaging, and impactful.","startsAt":"2024-10-22T11:30:00","endsAt":"2024-10-22T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["0188cbf4-17cc-441c-8ab5-fe9262df9305"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"689642","title":"We Fight for the User's...Session","description":"Ever since cookies were invented 30 years ago there has been a battle to protect them from theft and abuse.  Browser designers add defensive features and attackers come up with new ways to weasel through those defenses, steal session cookies, and become a clone of their victims as far as the website is concerned. This talk will speed-run that arms race, highlighting why many of the old-school defenses are still valuable.  We'll also cover some of the latest proposals including the mostly dead \"Token Binding\" technique and Google's newly introduced \"Device Bound Session Credentials.\"","startsAt":"2024-10-22T13:30:00","endsAt":"2024-10-22T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["85ddf61a-a2ab-4a5c-9b89-ea3ccf8bc975"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"722883","title":"CTF Basics: Essential Skills for First-Time Competitors ","description":"Are you interested in competing in your first CTF but not sure where to start? Join us for this primer of all things capture the flag: What they are, the different types, general skills, classic cryptography and steganography. ","startsAt":"2024-10-22T13:30:00","endsAt":"2024-10-22T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["cdab35d4-838c-483a-89da-76e6b19407ce"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"683218","title":"Principles of An Effective Security Awareness Training For Non-Technical Staff","description":"Join us in a hand-on session to discuss human thought patterns and how some users make the hacker's exploit efforts too easy. We will breakdown past security incidents, statistics, and go over the steps you can take to protect your organization against the human element.","startsAt":"2024-10-22T13:30:00","endsAt":"2024-10-22T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["8de70a21-f8ca-4bc2-b30d-5b46d4d0101f"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"739844","title":"AI in Utah Education: Current and Future Inroads For AI Education","description":"In November 2022 OpenAI launched ChatGPT4 and it took the educational world by storm. Very quickly schools and teachers were looking for resources on how to best work through generative AI in educational settings. Join Utah State Board of Education AI Specialist Matthew Winters for a conversation about how Utah schools are navigating AI and what the future holds for AI in education. ","startsAt":"2024-10-22T13:30:00","endsAt":"2024-10-22T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["563efcc3-e4f9-4477-bd42-3f76c4d495eb"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"691567","title":"You tucked in technology, but did marketing let a stranger into your servers last night?","description":"This is a light, entertaining dive into the relationships being built outside the IT department and the risk to your institution. We throw marketing under the bus only to see that IT might have given the bus the green light to go.  Engaging, relatable stories of real third-party risks will pull in attendees and have them asking for more!","startsAt":"2024-10-22T14:30:00","endsAt":"2024-10-22T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["a4425c1f-5350-400c-afcd-f04719dbdec5"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"737949","title":"If You're Not Moving Forward, You're Moving Backward","description":" Yes, cybersecurity is getting harder. If you've got 10 years in the field, half the technology you're securing didn't even exist when you started in cybersecurity. If you're an OG, that percentage is probably closer to 90%. Generative AI wasn't a real enterprise security concern even two years ago, and now you can't get away from it. This constant movement in tech means that the cybersecurity professionals who succeed will need to constantly adapt to changing security conditions and upskill to address these new challenges. In this talk, Jake will provide strategies for identifying emerging cybersecurity issues so you can stay ahead of curve and specific recommendations for skills you can develop today that will help separate you from the herd. We'll close with professional development advice that will help you perpetually improve your skill set and ensure you're ready for the challenges of tomorrow.","startsAt":"2024-10-22T14:30:00","endsAt":"2024-10-22T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["876d5487-271f-430a-8da2-00f69cd99e46"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"685422","title":"What, When, and How to Disclose Security Events","description":"This session will discuss strategies for crafting both internal and external communications regarding security events.\r\n\r\nJoin us as a former Fox13 news anchor and investigative reporter teaches the pitfalls of interacting with the media and the critical skills needed to help ensure you don’t go viral.","startsAt":"2024-10-22T14:30:00","endsAt":"2024-10-22T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["a7a91a3b-3254-4dfd-9e42-721d8ccf4b7a"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"720210","title":"How to implement happy MFA users in K12","description":"MFA is now a standard security practice.  Have you implemented it in your district yet?","startsAt":"2024-10-22T14:30:00","endsAt":"2024-10-22T15:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["6dfed1df-1e50-4b8b-884d-b63cf81eaa46"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"698587","title":"So You Want to be a Pentester?","description":"This presentation is for those interested in working in a pentesting position. Briefly, I'll go over what is pentesting and pentesting types. Then discuss what day-to-day work and typical projects are like. For better context, I'll explain how I got started in pentesting and some fellow collogues experiences as examples. Lastly, some advice on resources and certification to help gain experience to better prepare for a pentesting role. ","startsAt":"2024-10-22T15:30:00","endsAt":"2024-10-22T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["9868adf1-c460-4ad0-bde3-698c41f577d2"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"716721","title":"Your security skills are unbalanced. How to become cybersecurity bilingual to enact real change","description":"In today's dynamic threat landscape, navigating the complexities of cybersecurity can often feel like traversing uncharted territory. The emergence of sophisticated cybercriminal operations underscores the need for organizations to adopt proactive approaches to detection and response. This abstract proposes a comprehensive framework that integrates business principles with cybersecurity strategies to bolster organizational resilience against evolving threats.\r\n\r\nDrawing inspiration from established business frameworks such as GOST (Goals, Objectives, Strategies, Tactics), this framework offers a structured approach to understanding cybercriminal objectives and tactics. By aligning cybersecurity initiatives with overarching business goals, organizations can prioritize investments and allocate resources effectively.\r\n\r\nCentral to this framework is the concept of two-way communication between security and business leadership. Effective dialogue facilitates the translation of technical cybersecurity insights into business-relevant language, enabling informed decision-making and resource allocation. Through collaborative discussions, organizations can identify key cyber threats and tailor detection and response strategies to mitigate risks effectively.\r\n\r\nFurthermore, the integration of the MITRE ATT&CK framework enhances threat analysis by providing a detailed taxonomy of adversary tactics and techniques. This granular understanding enables organizations to develop targeted detection capabilities and measure the effectiveness of their security measures through meaningful metrics.\r\n\r\nThe abstract also outlines strategic approaches for fostering synergy between cybersecurity and business operations. By adopting a bilingual communication approach, organizations can articulate cybersecurity risks in terms readily understandable by all stakeholders. Leveraging empirical evidence to quantify the financial implications of security breaches enables organizations to make evidence-based decisions and prioritize cybersecurity investments effectively.\r\n\r\nUltimately, this abstract advocates for a holistic approach to cybersecurity that transcends technical proficiency. By leveraging business frameworks, organizations can develop robust detection and response strategies that align with overarching business objectives. Through cohesive collaboration between security and business teams, organizations can fortify their resilience in an increasingly perilous digital landscape and stay ahead of cyber threats.","startsAt":"2024-10-22T15:30:00","endsAt":"2024-10-22T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["a0114df1-5083-49ac-8f42-798be5cb3190"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"725340","title":"Blinded by TunnelVision: Exploiting Security Risks in Network Protocols","description":"Network protocols are the backbone of digital communication, yet their features can turn into inherent vulnerabilities leading to exploits that undermine network security. This presentation builds on the research from Leviathan Security's \"TunnelVision\" vulnerability and insights from recent findings on Virtual Private Networks (VPNs) security flaws, to address the manipulation of the DHCP protocol and its implications for network integrity.\r\nWe will start by dissecting the components that make up TunnelVision, including the star: Dynamic Host Configuration Protocol or DHCP, a critical protocol for dynamically assigning IP addresses within networks. We will then dissect the TunnelVision vulnerability, exploring how “features” in the DHCP protocol were misused to allow attackers full access to user’s unencrypted data. We will discuss how many VPN providers were left vulnerable to Malory-in-the-Middle attacks despite claiming they were protecting your data. \r\nTo show the impact of this vulnerability we will discuss results of real-world experiments where we have launched TunnelVision attacks and the data we saw. We will provide a demo of the hardware and software required to replicate our attacks. We will discuss VPN providers that are still vulnerable to this attack and how your own VPN could be susceptible.\r\nBy understanding these manipulation tactics, attendees will gain insights into how these vulnerabilities can be exploited to redirect traffic, intercept data, and bypass traditional security measures.\r\n\r\nThe presentation will cover:\r\n     The fundamentals of DHCP and its role in network operations.\r\n     Real-world examples of DHCP manipulation and its impact on network security.\r\n     The intersection of DHCP vulnerabilities with other protocols and security tools.\r\n     Advanced strategies for detecting and mitigating these risks to maintain robust network security.\r\n\r\nThrough a detailed analysis of both research findings, demonstrations and case studies, this session aims to equip security professionals with the knowledge needed to safeguard their networks against sophisticated threats targeting core protocols. Attendees will leave with practical approaches to enhance their security posture and protect against the exploitation of DHCP and related network vulnerabilities.","startsAt":"2024-10-22T15:30:00","endsAt":"2024-10-22T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["f6b9f974-e5d3-46f8-b8eb-5f69a8d8c0c7"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"735509","title":"Staying Ahead of Education CyberSecurity Requirements: The Critical Roles of CISOs and Security Mgrs","description":"Panel discussion focused on cybersecurity leaders and roles across all levels of education (K-12 through Higher Education).  Discussion points will focus on state-legislated requirements, growing threats and security trends, managing costs, and prioritization of solutions securing education frameworks.","startsAt":"2024-10-22T15:30:00","endsAt":"2024-10-22T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["51e0d54b-f082-4815-91f4-69587812f0da","2ef38a62-4bad-4ba8-9e79-9d9d5450eb7b","a7a91a3b-3254-4dfd-9e42-721d8ccf4b7a","77f87122-a3c3-4526-8252-cb686cf426b9","9eada925-a9b2-430d-bda0-6709167631e4","da0ea4e0-3b07-41a1-92cc-16b561e01e39","1764f856-b76e-4437-b043-5c6e34b169b7"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"726676","title":"Wednesday Keynote","description":null,"startsAt":"2024-10-23T09:00:00","endsAt":"2024-10-23T10:30:00","isServiceSession":false,"isPlenumSession":true,"speakers":["e910ded0-5dae-447b-ba3e-10182cc7f745"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"697970","title":"Document, Detect, and Defend: Alerting and Detection Strategies That Really Work!","description":"Join me for a rapid-fire briefing on leveraging the Palantir Alerting and Detection Strategy (ADS) Framework to take your detection engineering to the next level! In just 25 minutes, learn how to create, document, and track high-quality alerting strategies that minimize false positives and enhance your team’s detection capabilities. This session will provide practical insights and a concise overview of implementing the ADS Framework to ensure every alert is effective and validated.","startsAt":"2024-10-23T10:30:00","endsAt":"2024-10-23T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["e033693c-a25f-4ad6-846d-113dd9a40e88"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"688155","title":"Building a Culture of Trust in Information Security","description":"Sometimes, the ISO strides into the office, casting a shadow longer than the HR director's dreaded memos. But fear not! In this talk, we'll transform that apprehension into admiration by unraveling the secrets of building a culture of trust in information security. Get ready to turn the tables and make security the hero of your organization's story!","startsAt":"2024-10-23T10:30:00","endsAt":"2024-10-23T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["77f87122-a3c3-4526-8252-cb686cf426b9"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"689315","title":"Unlocking Physical Security: 3D Printing Your Way Inside","description":"Every hacker wants more cool stuff and many of us have a 3D printer gathering dust in the corner. This session will inspire the audience to buy more filament and start preheating their print beds to extrude a collection of valuable physical security tools (both offensive and defensive). This talk goes over a handful of original (never before seen) designs, 3D-printable versions of existing tools, explains how to use each tool, offers practical advice to those who want to 3D print their own physical security tools, and shows the audience where they can find my models and others to print. ","startsAt":"2024-10-23T10:30:00","endsAt":"2024-10-23T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["adc8b351-8a1e-4b6f-9b3a-15f3f6629e9f"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"735523","title":"Security on a budget","description":"Discussion of open source tools used by schools","startsAt":"2024-10-23T10:30:00","endsAt":"2024-10-23T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["5bf31e4a-5659-4154-9020-6047761e4070"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"697827","title":"AD Hardening: Strategies for Tiered Infrastructure and Minimizing Privileges","description":"For those still dealing with on-premise or hybrid Active Directory deployments, this is a great starter discussion on how you can begin your journey tiering out/securing your Active Directory environment.","startsAt":"2024-10-23T11:00:00","endsAt":"2024-10-23T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["c710a865-5da9-4f65-ba60-6ca1c99d21a4"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"686986","title":"Taking off from endpoints to the cloud","description":"Technology is evolving. We’ve gone from dial up connections telling us “you’ve got mail” to massively complex, auto-scaling corporate cloud environments leveraging all of our favorite technology buzzwords. The common trend today for businesses seems to be moving their environments away from the endpoint and into the cloud. In this talk, I will describe my journey as I transitioned from a long time endpoint threat researcher into the cloud. The talk will include lessons learned such as learning the hard way that cloud APIs and logs are not always stable and what you expect to see is not always what you actually see. I will cover new concepts I had to tackle that weren’t present in the endpoint such as IAM, roles, permissions, OAuth scopes, service accounts, and more. I’ll also provide some practical tips for anyone who is trying to get into cloud security research such as where to begin, how to quickly start recreating/analyzing adversary techniques, and how to avoid and overcome some of the common mistakes many run into. Finally, I’ll talk about how I overcame the many obstacles inherent to those starting to learn cloud security and showcase how my research has helped our company ship a cloud security product that detects threats and diminishes risk for our customers. \r\n\r\nIf you are someone who finds yourself needing to get into cloud security but don’t know where to start, this talk is for you.","startsAt":"2024-10-23T11:00:00","endsAt":"2024-10-23T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["20a81b6a-720c-4946-b433-bce19fdffc03"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"743241","title":"Social engineering a hotel is downright inhospitable","description":"Spam filtering tools are now extremely adept at blocking unsolicited emails cattying attachments that come from accounts you haven't interacted with. So if you're an enterprising malware gang, how to you get around the problem?\r\n\r\nApparently, one way to successfully do it is to engage with the target in a benign email conversation first, which establishes a message history between the target and attacker, and wears down a spam filter's resistance to subsequent emails, even if they have attachments.\r\n\r\nThe research uncovered a series of attacks targeting specific kinds of businesses - hoteliers and tax accountants - in which the attackers leveraged this weakness in email protection by emailing the targets and cattying on a back-and-forth conversation before delivering the payload. Based on the messages we've seen, the attackers may have used generative AI to create realistic, grammatically correct messages.\r\n\r\nIn the case of the attacks targeting hotels, the messages purport to come from a recent guest who alleges some form of wrongdoing by hotel staff. The wide variety of misbehavior the attacker accuses an unnamed staff member of doing - from racist attacks to allegations of violence - elicit an immediate response from hotel managers. In the attacks targeting tax preparers, the conversations are much more banal but ask for a quick response due to an impending deadline to file taxes. In both cases, the victim asks the attacker to send documentation, and the attacker responds with a malicious payload.\r\n\r\nIn this talk, we'll explain how this technique upends algorithmic analysis of unsolicited email, and poses a vulnerability in modern email protection systems, where they fail to identify the final payload as malicious as a result of the conversation that precedes its delivery.\r\n\r\nWe will also discuss the anti-analysis characteristics of the final payloads, which make it difficult for someone who is not a malware analyst to study or even validate as legitimate.","startsAt":"2024-10-23T11:00:00","endsAt":"2024-10-23T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["bd7d0a2c-5718-4c76-a713-2e6c91c752e4"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"720952","title":"Drone Law update.  Did they BAN DJI?","description":"The future of DJI drones in the US remains undecided as a proposed bill, the \"Countering CCP Drones Act,\"  works its way through Congress. This act aims to restrict DJI's access to US communication networks, effectively grounding their drones.","startsAt":"2024-10-23T11:00:00","endsAt":"2024-10-23T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["6f597031-dc92-4b21-90d2-3dc7f78bca46"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"692268","title":"Finding 0days in Vilo Home Routers","description":"From January to May 2024, a team of student researchers at Brigham Young University looked for 0days in a consumer-grade home router made by Vilo Living. By April 2024, they had found 9 zero days, 6 of which were critical. This presentation covers the process they went through from initial reconnaissance to hardware hacking to finding buffer overflows to reporting the bugs to the organization.","startsAt":"2024-10-23T11:30:00","endsAt":"2024-10-23T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["947caee7-c202-4beb-a094-fd1adbca9573","b36a6f1a-3866-45e2-8474-43e18d9ab9a6"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"721569","title":"Open Source Terrors","description":"While seemingly \"free\", open source software often comes with a complex web of dependencies, which can introduce vulnerabilities, licensing conflicts, and quality concerns. This presentation will help illuminate the risks inherent in using open source software, as well as different tools available to help manage and mitigate those risks. This session is especially good for individuals where their company is just starting to look at open source software usage and they want to better understand the risks that they need to pay attention to. ","startsAt":"2024-10-23T11:30:00","endsAt":"2024-10-23T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["74ec89de-524b-4efb-9ef9-5b835ad9e26a"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"684506","title":"Introduction to Nix","description":"Nix is a cross-platform declarative package manager that powers the Linux distribution NixOS. This presentation will cover how Nix can be utilized to improve security workflows.","startsAt":"2024-10-23T11:30:00","endsAt":"2024-10-23T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["d1b0424c-fcff-484b-9002-3949725d4296"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"680860","title":"Disruptive Technology in Education","description":"Heard about kids using Flippers to disrupt education, lets talk about this and other devices causing issues with classroom instruction, and how to handle their use.","startsAt":"2024-10-23T11:30:00","endsAt":"2024-10-23T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["1764f856-b76e-4437-b043-5c6e34b169b7"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"699404","title":"Microsoft CA Exploits: From Misconfigurations to Full Domain Admin Takeover","description":"In today's cybersecurity landscape, even the smallest misconfigurations can have catastrophic consequences. Join us in this deep dive into the world of Microsoft Certificate Authority (CA) misconfigurations, where we'll expose the hidden vulnerabilities that can turn a single compromised user account into a full domain admin nightmare. This session will guide you through real-world case studies and technical demonstrations, revealing how attackers exploit these common mistakes to gather sensitive network and user data, escalate privileges, and gain persistent access. You'll learn how these oversights occur, the tactics hackers use to exploit them, and most importantly, how your blue team can detect and prevent such attacks. Arm yourself with the knowledge to fortify your CA infrastructure and protect your organization. ","startsAt":"2024-10-23T13:30:00","endsAt":"2024-10-23T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["a1d037c1-a328-4dd3-b90f-0bdc82c7ebb3"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"698940","title":"Come on down! You're the next contestant to poorly manage your session state.","description":"This will be an in-depth talk for novice/advanced/expert level as we take a step through the rainbow (red/purple/blue) teams focusing on session-based attacks for SaaS based systems. \r\n\r\nThis goal of this talk is to level up a novice/advanced/expert with different attack methods that they can utilize on how to execute attacks and build a stronger defense in their environment to enhance security.\r\n\r\nThis talk will go deeper than phishing and pass-the-cookie attacks, but look into other methods of hygiene that attackers can exploit. \r\n\r\nIn this talk you will:\r\nLearn how attackers execute these attacks\r\nLearn how red/purple teams conduct test exercises \r\nLearn how blue teams manage/monitor these events\r\nUnderstand methods to enhance design/architecture to mitigate or prevent attacks","startsAt":"2024-10-23T13:30:00","endsAt":"2024-10-23T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["8cf310cf-a644-4774-baa6-967628fee847","9ff61bba-4e21-4846-b6b9-79c309ed3f29"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"696862","title":"5 Strategic Investigations for Compromised Google & Microsoft Accounts","description":"Maintaining data security is a never-ending game of cat and mouse. You must identify the multitude of files being shared outside your domain and take necessary action to ensure they don’t contain sensitive information. It’s equally important to quickly detect patterns of concerning logins that could indicate a compromised account. \r\n\r\nIT leaders need an efficient way to search for content and behavior in school-provided technology that represents real school safety concerns—as well as federal & state compliance issues.\r\n\r\nInvestigations to audit your environment don’t have to be complicated or even take very long. In this session, we will walk you through the easy strategic investigations you can perform with the tools you already have, to improve your cloud security and safety posture. \r\n\r\nDon't miss this opportunity to stay ahead of the criminals. You will leave this session empowered to proactively safeguard your district’s cloud data, fostering a safe and secure learning environment for students, educators, and staff alike. ","startsAt":"2024-10-23T13:30:00","endsAt":"2024-10-23T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["9f6278b9-8e2a-4359-a382-fb020d3b6eba"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"698925","title":"Are Vulnerability Scanners Dead? Transcending CVEs for Vulnerability Management","description":"In the 1800s, lamplighters were employed to light gas streetlights that had replaced the previous generation of candles and oil lamps. However, with the advent of incandescent lighting and the automation provided by electricity, lamplighters became largely obsolete. \r\n\r\nFor decades, we’ve relied on vulnerability scanners to assess our assets and generate reports containing IP addresses and their associated CVEs. CVEs add value but only represent a subset of your risk exposure. They completely miss critical variables such as the presence and state of endpoint IT management and security controls, making them largely obsolete when relied upon in a vacuum. \r\n\r\nThis reliance on CVE data leads to a distorted view of an asset's risk level, making it difficult to prioritize remediation efforts accurately. This also negatively impacts overall organizational risk, while the sheer volume of CVE data wastes time, money, and resources. \r\n\r\nDoes it matter how many CVEs you detect if the device has no controls to remediate them? A modern approach to vulnerability management must transcend the realm of CVEs and encompass exposures related to environmental vulnerabilities. These include gaps like missing endpoint controls, outdated or non-communicative controls, and misconfigurations. \r\n\r\nWhen it comes to CVEs, in many cases, CVE data can be pulled directly from IT management and security controls that you already have installed on your endpoints. This negates or greatly reduces the value derived from a traditional vulnerability scanner, which, by its nature, can also be risky to run and onerous to operationalize as part of an integrated vulnerability management strategy. Regardless of where the operating system and application CVEs are derived, they must be correlated with environmental vulnerabilities. \r\n\r\nAfter correlating CVEs and environmental variables, your vulnerability management strategy can be taken to the next level. Risk prioritization can include identity data and business context enrichment by linking assets with regulatory mandates, critical systems, supply chains, geographic regions, business units, etc. \r\n\r\nWith this level of accuracy in risk prioritization, automated ticketing and response integration capabilities can be efficiently and effectively leveraged with the understanding of which risks may be mitigated or are already being mitigated by existing IT management and security controls. Finally, your vulnerability management strategy can be more formally operationalized with real-time remediation validation to ensure that what was stated as being fixed was actually fixed and stays fixed, as well as metrics to measure the effectiveness of your remediation efforts. \r\n","startsAt":"2024-10-23T14:30:00","endsAt":"2024-10-23T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["ab4cffda-24cf-4c8b-897e-262459f5b054"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"724987","title":"Privacy Countersurveillance","description":"Are you being recorded?  From digital assistants, to doorsteps, to meetings, to restrooms, and rental properties there are concerns about surveillance nearly everywhere in modern life.\r\n\r\nI will share my journey to become more aware of the surveillance around me, and what I have learned I can do about it.","startsAt":"2024-10-23T14:30:00","endsAt":"2024-10-23T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["666ee1c6-207f-4e7c-bf7e-1a55f4154de3"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"692498","title":"Incident response and NIST CSF 2.0","description":"With NIST CSF 2.0 now out I'll help map the control to processes dealing with incident response. ","startsAt":"2024-10-23T14:30:00","endsAt":"2024-10-23T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["9b493d47-18ca-4d91-98b6-ebce7435b31d"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"756249","title":"AI & Mobile Privacy Concerns","description":"Protecting your data as privacy expectations continue to decrease in an ever more integrated world.","startsAt":"2024-10-23T14:30:00","endsAt":"2024-10-23T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["e33f4f3a-0dbf-4b78-ac28-b570d4267e3d","f8dfd609-87df-4d2e-9e94-6f400d60a4aa"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"699512","title":"Operation: We Saw That Coming - Supercharging SOC with Smarter Threat Intelligence\"","description":"Discover how to turn your Security Operations Center (SOC) into a proactive powerhouse using Cyber Threat Intelligence (CTI) as a focal point for SOC operations. This talk delves into the necessity of integrating CTI into SOC frameworks, and how it accelerates the maturity of Cybersecurity Operations. Learn how effectively integrating CTI can enhance threat detection, streamline incident response, and align cybersecurity strategies with business objectives. Through real-world case studies and best practices, we'll show you how to stay ahead of adversaries and fortify your defenses against emerging threats.","startsAt":"2024-10-23T15:30:00","endsAt":"2024-10-23T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["25374725-93db-4878-beee-8c37ce1118f9"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"699427","title":"Vendor Vortex: Uncovering Hidden Threats in Third-Party Software","description":"In today's interconnected world, third-party vendor software is deeply integrated into our IT infrastructures. However, these integrations often come with hidden vulnerabilities that hackers can exploit to gain unauthorized access and control over networks. Join us for an eye-opening session where we reveal how seemingly innocuous third-party tools can become potent attack vectors. \r\n\r\nWe'll demonstrate real-world scenarios, including a vulnerability we discovered in a common Uninterruptible Power Supply (UPS) that allowed us to take over a target network. You'll also see how a blind remote code execution vulnerability in a Java RMI web interface that we leveraged to create a local admin account. Additionally, we'll showcase a vulnerability in the SecureWorks Snare Enterprise Agent, demonstrating how our team exploited it to gain administrator access on a remote system.  \r\n\r\nBeyond the technical demonstrations, we'll discuss proactive strategies for identifying and mitigating risks associated with vendor software. Learn how to screen vendors, recognize potential issues before they become critical, and implement robust defenses to protect your organization from these hidden threats. This session promises to be both educational and engaging, with practical takeaways to strengthen your cybersecurity posture. ","startsAt":"2024-10-23T15:30:00","endsAt":"2024-10-23T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["96691be9-112a-4a46-95bd-6fba3eef6419"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"729454","title":"IP Route Security - What you NEED to know!","description":"We will be talking about one of the oldest, and potentially damaging vulnerabilities on the internet what most people don't even know to look out for.  IP Route Security, and the story of BGP route Hijacking and the impact it can have on your network.","startsAt":"2024-10-23T15:30:00","endsAt":"2024-10-23T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["1764f856-b76e-4437-b043-5c6e34b169b7","042aa25f-e50d-4e85-9520-505f19833b7d"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"738851","title":"Managed Apple ID’s","description":"Jordan school District implemented managed Apple IDs this summer and the full 1:1 iPad pilot . Let’s talk about  lessons learned . \r\n","startsAt":"2024-10-23T15:30:00","endsAt":"2024-10-23T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["a7a91a3b-3254-4dfd-9e42-721d8ccf4b7a","50948ddc-7a5c-4f36-a38f-8928b4d1e53d","67c37949-2bd1-452a-95c9-1cc481f2c2f0"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"726674","title":"A Practical Post-Incident Case Study for SMB Response Teams","description":"This keynote presentation will delve into a real-world incident involving a masked application attack on an SMB environment, as an entry point to discuss and provide recommendations on detection and response for SMB teams. Amanda Berlin, Director of Incident Detection Engineering at Blumira, will walk step-by-step and minute-by-minute through an actual discovered attack on an anonymized small-business target, from the initial malicious download through investigation, response, and reporting on the newly identified attack method. Amanda will then break down the system and methods informing her team’s response process, as well as defining concrete, actionable recommendations illustrated by this incident. Attendees will leave the session with a better understanding of how to keep their teams safe (and sanity intact!) when navigating one of the hardest situations defenders can face through intentional preparation and planning -- don't miss out!","startsAt":"2024-10-24T09:00:00","endsAt":"2024-10-24T10:30:00","isServiceSession":false,"isPlenumSession":true,"speakers":["f399a7f0-38b1-46b3-8bab-8041ea88dfe2"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"725303","title":"A Quick Story Of Security Pitfalls With Exec Commands In Software Integrations","description":"When building software integrations, developers face important decisions that are influenced by time, budget, and the technologies they know and sometimes these decisions can lead to security vulnerabilities. This talk will look into the reasons developers might choose to run other programs directly from their code, rather than using libraries, SDKs or external APIs, and the security risks this choice can bring.\r\n\r\nWe will explore command injection attacks, a well-known security issue that remains a major threat. These attacks happen when our code directly runs other programs, leading to potential security breaches. Our discussion will cover the basic principles of how programs interact with each other and the tools we can use to understand these interactions.\r\n\r\nBy examining a real case of command injection vulnerability I found (CVE-2023-39059) in a popular open-source project. We will learn the methods, tools and techniques for finding and exploiting such vulnerabilities.\r\n\r\nFinally, we will talk about ways to detect and prevent these kinds of attacks. We’ll discuss how to spot these vulnerabilities and the steps we can take to protect our software.","startsAt":"2024-10-24T10:30:00","endsAt":"2024-10-24T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["7f867679-2ee8-485e-abe8-caaa000634c0"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"721632","title":"Voice cloning and phishing messages","description":"Our team at Brigham Young University is developing a research study on the effectiveness of voice cloning, specifically for phishing messages. Recently, an explosion of accurate and real-time voice cloning models have resulted in new vishing attacks. Our study uses a voice cloning model in a university setting to test how students respond to this new type of vishing attack.","startsAt":"2024-10-24T10:30:00","endsAt":"2024-10-24T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["149ef35b-9b8e-4c1e-a4e1-d224fbe85233"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"766818","title":"Zero Trust and AI with Zscaler","description":"This session will go over Zscaler's innovative approach to implementing a Zero Trust approach to cybersecurity. We use Artificial Intelligence in several ways throughout our platform. We will cover all the uses of AI in our platform.","startsAt":"2024-10-24T10:30:00","endsAt":"2024-10-24T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["d438ce0f-caa8-49e1-93d9-31b2ace0d991"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"680858","title":"Essential Security Capabilities needed in Education Environment","description":"We will cover the recommended security capabilities that each education entity should have well-established to protect themselves.","startsAt":"2024-10-24T10:30:00","endsAt":"2024-10-24T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["1764f856-b76e-4437-b043-5c6e34b169b7"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"719017","title":"What we know about Vulnerability Management is Wrong.  Myths and Misconceptions in Vuln Management","description":"Come take a holistic look at Vulnerability Management and common myths, misconceptions and mistakes that we all make in our programs.","startsAt":"2024-10-24T11:00:00","endsAt":"2024-10-24T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["75f98fd2-2cef-47e9-90db-fd14f90d784e"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"724835","title":"Let's build an AI Security Research Team using Python","description":"AI Agents are all the buzz these days. What is an AI agent? How do you build one? More importantly, WHY would you want to build a team of AI Agents?\r\n\r\nLet's dive into the world of AI agents. We'll show you how to build one using CrewAI and then we will make it applicable to a Security Analysts work.\r\n\r\nThis presentation will have a linked Github repo so you can take what you learn and implement it after the conference.","startsAt":"2024-10-24T11:00:00","endsAt":"2024-10-24T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["d964337c-bbdd-427c-bafb-f779746ac62f"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"719682","title":"It's time to stop phishing and get back to work","description":"Phishing attacks continue to be a significant threat to organizations and individuals alike. Traditional password-based authentication methods are vulnerable to social engineering, credential theft, and phishing scams. In this session, we explore how passkeys—a modern approach to authentication—can effectively thwart phishing attempts and enhance overall security.","startsAt":"2024-10-24T11:00:00","endsAt":"2024-10-24T11:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["2793735c-b54c-46b8-9949-ffb380a46a1a"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"746347","title":"Education Security: Birds of a Feather General Discussion","description":"Come share lessons learned and ask questions of your peers working in the K12 and Higher Education.","startsAt":"2024-10-24T11:00:00","endsAt":"2024-10-24T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["ee01b4af-c28b-4258-96bf-0ca7102abc84"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"699099","title":"Building Trust: How Engineering and Security can Speak the Same Language","description":"This talk explores the dynamics of collaboration between security and engineering teams, emphasizing the importance of understanding each other's unique traits and working styles. Through analysis of real-world projects and case studies, we will illustrate effective partnership strategies, such as simplifying communication, avoiding assumptions, and ensuring mutual understanding. Attendees will learn best practices for non-coding technical personnel, including continuous learning and consistent engagement with engineering teams. By bridging the gap between these critical teams, organizations can achieve enhanced outcomes and drive innovation in a secure environment.","startsAt":"2024-10-24T11:30:00","endsAt":"2024-10-24T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["150bf0e3-9d48-4d23-b0b4-bad04c2247d4","ebd588b5-9389-4ee3-a23f-711a28599296"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"721571","title":"Enhancing API Security with AI: Earn Security with Intelligent Testing","description":"APIs are a leading attack vector often left insecure due to insufficient testing. This talk will help you fix testing to lock down your APIs!","startsAt":"2024-10-24T11:30:00","endsAt":"2024-10-24T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["37fc132d-0b1b-4b0c-a8fe-821eeef6c9e6"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"681546","title":"Google Looker 0-Day(s)","description":"Shadowscape researchers found multiple 0-days related to the Google Looker project - leading to cross tenant access & RCE within GCP. https://cloud.google.com/support/bulletins#gcp-2024-025","startsAt":"2024-10-24T11:30:00","endsAt":"2024-10-24T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["08f75383-af61-47ec-aead-277449658144"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"722750","title":"Getting your start in Cybersecurity for practically free™","description":"There are many interested in getting started in Cybersecurity, but just not sure where to start or feel they have enough money to get the certs they need. From my own experience I lay out solutions for people in this same dilema that I was in myself, trying to get certs without money or feeling they don't have the time to learn more. Also, it is important to have resources to start with and this talk does not lack in that regard.","startsAt":"2024-10-24T13:30:00","endsAt":"2024-10-24T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["b5b91a8e-e669-42ec-9c94-2a28c145a806"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"737951","title":"The Bug Bounty Battlefield: A Choose Your Own Adventure Story on Why I Stopped Reporting Bugs","description":"Premier Speaker TBD","startsAt":"2024-10-24T13:30:00","endsAt":"2024-10-24T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["0d7120ab-8c6e-4374-aeeb-ef9caf080c9f"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"723949","title":"The Data Dilemma","description":"In 2023, the cybersecurity landscape witnessed a significant transformation as prominent threat groups, previously notorious for their ransomware attacks, pivoted towards a new strategy: data theft extortion. This shift reflects a growing trend among cybercriminals who, recognizing the increasing value and sensitivity of data, have started to prioritize exfiltrating and leveraging stolen information as a means of coercion. By exploiting vulnerabilities to access and steal critical data, these groups are not only demanding ransoms but also threatening to expose or sell the information unless their demands are met. This evolution in tactics underscores the need for enhanced data protection measures and a proactive approach to cybersecurity in order to mitigate the risks posed by these evolving threats.\r\n\r\nWe will delve into effective strategies to combat data theft by implementing multi-layered security measures that can significantly reduce the threat of these increasingly sophisticated data extortion tactics.","startsAt":"2024-10-24T13:30:00","endsAt":"2024-10-24T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["81d57f49-335a-4e96-9f89-b87129326854"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"761627","title":"Representative Ryan Wilcox HB.84 School Safety Amendments","description":"Representative Ryan Wilcox with the State of Utah will speaking on and answering questions in regards to amendments to House Bill 84 School Safety","startsAt":"2024-10-24T13:30:00","endsAt":"2024-10-24T14:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["23741f73-f17d-427d-8f3f-9879b76c8526"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"724537","title":"Offense for Defense","description":"This presentation focuses on the offensive tools that defenders should running, to identify high-impact security issues on their network. Explore the proactive advantages of offensive security tools that can be quickly and easily be run by defenders to better protect and defend their network. Attendees will learn how offensive security tools enable defenders to stay ahead of potential adversaries, enhancing network resilience and safeguarding against breaches effectively.","startsAt":"2024-10-24T14:30:00","endsAt":"2024-10-24T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["69f81aa8-3c4e-4ae8-a494-acebba3aff73"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"737947","title":"Release The Hounds, Part 3 - History Repeating","description":"CTA for cybersecurity wantrepreneurs, disclose.io backstory and CTA for social/policy motivated folks, where the security problem/solution space is up to in 2024 contrasted with 2012, what that suggests about where it’s going, where hackers can slot into it, and where we need to push.","startsAt":"2024-10-24T14:30:00","endsAt":"2024-10-24T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["f740cf3b-d4c6-4811-88cc-6eb5fb3fe451"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"725961","title":"So, you want to be a CISO","description":"Being a Chief Information Security Officer (CISO) is a demanding and multifaceted role, often filled with a continuous stream of security incidents, unfunded mandates, and high expectations. Despite these challenges, the position offers a unique opportunity to have a significant impact on organizations as you lead them toward security excellence. In this session, Adam Marrè will demystify the CISO role, exploring the essential skills, responsibilities, and daily challenges that define this pivotal position. Through vivid illustrations and real-world examples, attendees will gain key insights into what it takes to not only become a CISO, but to excel in the role.","startsAt":"2024-10-24T14:30:00","endsAt":"2024-10-24T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["9478990b-a830-454c-834d-d51501e4269a"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"720942","title":"Esports Just Got Real: Building A Secure Gaming Framework","description":"With the eventual adoption of Esports by the UHSAA starting in 2025 it is important to create a safe and secure environment for Esports participants.  ","startsAt":"2024-10-24T14:30:00","endsAt":"2024-10-24T15:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["76edcbf4-0215-492e-a6e9-0bd1fc8677d2","51e0d54b-f082-4815-91f4-69587812f0da","db5436d4-1a4d-480e-a910-efa9e9b7c62d"],"categoryItems":[],"questionAnswers":[],"roomId":53445,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"695911","title":"How to Avoid Sanctions and Fund a Nuclear Weapons Program","description":"Everyone's favorite country, the Democratic People's Republic of Korea (DPRK), is well known for their grand heists (Bangladesh Bank and millions in cryptocurrencies) but its not always about super high profile operations. In this talk, we're going to talk about the methods the DPRK uses to make money, how you've probably been exposed to it, and how you possibly directly contributed.  ","startsAt":"2024-10-24T15:30:00","endsAt":"2024-10-24T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["9ff61bba-4e21-4846-b6b9-79c309ed3f29"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"725436","title":"How To Reclaim Privacy in the Digital Age","description":"Privacy has largely disappeared in the digital age. The devices we use silently betray us, the companies we engage with analyze our private conversations and use our sensitive information to build profiles about us, and data brokers harvest everything they can find and sell it to countless others including governments around the world. But there are absolutely things that we can do to dramatically improve our privacy online. This talk will provide a guide for steps that you can take to reclaim your digital lives. ","startsAt":"2024-10-24T15:30:00","endsAt":"2024-10-24T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["9c72f818-04d9-4ca4-b048-181dcd885b3e"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"725424","title":"(A)ssembly, (B)eaconing, and (C)ryptography: An ABC Intro to Malware Development","description":"Are you a blue teamer that wants to learn more about those pesky viruses you're always stomping? Or are you a penetration tester that wants to learn the basics of writing your own implants? Either way, this is the presentation for you! We will make our way through the alphabet, all the way from A, to Z, learning about important Malware Development topics and tricks.","startsAt":"2024-10-24T15:30:00","endsAt":"2024-10-24T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":["fa9588b9-098c-408a-8514-b24d6368f379"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"688010","title":"Importance of Software Bill of Materials (SBOMs) to help understand your security risk","description":"Software is very complex and the development of SBOMs has allowed ways to understand the true risk of software through matching libraries to vulnerabilities. I will go through the types of SBOMs and explain the two formats in use today and the difficulties of generation of SBOM in different stages of the software development cycle. Using these SBOMs will then go into how you generate a Vulnerablity EXchange (VEX) file from the SBOM to see the CVE and other vulnerabilities in the example package or image. I will demo a set of free tools available to generate SBOM and VEX files. Talk how you can use this information to track software issues that come up like log4j.","startsAt":"2024-10-25T10:00:00","endsAt":"2024-10-25T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["041cbfa8-1d6a-4c5c-a74e-8c1b3db584ab"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"680173","title":"The Badge Talk","description":"We need to talk... about the badge!","startsAt":"2024-10-25T10:00:00","endsAt":"2024-10-25T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["44651b54-aaa1-4643-bf33-f956414d2b77"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"699412","title":"Level Up Your Homelab Without Kubernetes","description":"Homelabs are an excellent way to become familiar with new technologies and learn enterprise-grade tools. The faster you can deploy and get started with new tools, the faster you'll learn. While Kubernetes is a great tool for enterprise workload orchestration, it's usually overkill for accomplishing these goals. In this talk I'll introduce Nomad, Consul, Vault, and Packer: tools from Hashicorp that dramatically simplify the growth of your homelab that allow your infrastructure to grow as you do.","startsAt":"2024-10-25T10:00:00","endsAt":"2024-10-25T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["b5440e39-8f72-4eb1-b9eb-5dad154cd309"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"722035","title":"Social Engineering for Good","description":"As security professionals, we are all to familiar with how social engineering can bypass the most well implemented security controls. Too often we try to reduce social engineering risks through initiatives like security awareness training, cyber security awareness month, or phishing tests. While it's debatable how effective these are, there is a better way. In this session, you will learn about the psychology of security and how to social engineer humans to naturally demonstrate good security habits. No more brow beating or FUD!","startsAt":"2024-10-25T11:00:00","endsAt":"2024-10-25T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["cc9d094a-8762-481d-8c57-6cda578c5bca"],"categoryItems":[],"questionAnswers":[],"roomId":47248,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"740142","title":"Hackers Challenge Shakedown","description":"A run-through of Hackers Challenge statistics and walkthrough of your fav^H^H^H^H most hated challenges.\r\n","startsAt":"2024-10-25T11:00:00","endsAt":"2024-10-25T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["023083a5-01a6-45fb-854a-7e022bd030c9"],"categoryItems":[],"questionAnswers":[],"roomId":47249,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"id":"755422","title":"SAINTCON: To Infinity and Beyond??!!!","description":"Come join the SAINTCON Committee members as we talk about the current and future state of the SAINTCON conference. We will talk about current and upcoming challenges as well.","startsAt":"2024-10-25T11:00:00","endsAt":"2024-10-25T12:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":["7f5e5ae7-5b73-4ccd-b2eb-b5647b12d22b"],"categoryItems":[],"questionAnswers":[],"roomId":47250,"liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true}],"speakers":[{"id":"9478990b-a830-454c-834d-d51501e4269a","firstName":"Adam","lastName":"Marre","bio":"Adam Marre is the Chief information Security Officer of the cybersecurity firm Arctic Wolf Networks, where he is responsible for all information security, data protection, compliance, and incident response operations in addition to physical security. Previous to that, he was the Head of Security Operations for Qualtrics with similar responsibilities. Prior to Qualtrics, Adam served as a Special Agent of the Federal Bureau of Investigation (FBI) for almost 12 years leading investigations into criminal computer network intrusions as well as cyber-based national security threats. He served as an adjunct professor of the FBI Academy, teaching cyber security investigative techniques, and served as a Senior Team Leader for an FBI SWAT Team. Prior to the FBI, he served as a counterintelligence agent for the US Army and was a Video Game Designer at Disney Interactive Studios.","tagLine":"CISO, Arctic Wolf","profilePicture":"https://sessionize.com/image/9140-400o400o1-BhrkBJYvQ3yP8dy7LpDYxw.png","isTopSpeaker":false,"links":[],"sessions":[725961],"fullName":"Adam Marre","categoryItems":[],"questionAnswers":[]},{"id":"08f75383-af61-47ec-aead-277449658144","firstName":"Aeden","lastName":"Murray","bio":"Director of Cyber Engineering @ Shadowscape","tagLine":"aeden@shadowscape.io","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[681546],"fullName":"Aeden Murray","categoryItems":[],"questionAnswers":[]},{"id":"f399a7f0-38b1-46b3-8bab-8041ea88dfe2","firstName":"Amanda","lastName":"Berlin","bio":"Amanda Berlin is the Director of Incident Detection Engineering at Blumira, where she leads the development of new detections for the Blumira platform, based on threat intelligence and research. \r\n\r\nAn accomplished author, speaker, and podcaster, Amanda is known for her ability to communicate complex technical concepts in a way that is accessible and engaging for audiences of all backgrounds. She co-authored an O’Reilly Media book Defensive Security Handbook: Best Practices for Securing Infrastructure, a comprehensive guide for starting an infosec program from the ground up. She is also co-host of Brakeing Down Security, a podcast about the world of cybersecurity, privacy, compliance, and regulatory issues that arise in today’s workplace. She also provides training for organizations on creating tabletop and incident response playbook programs.\r\n\r\nAmanda is the CEO and co-founder of Mental Health Hackers, a non-profit organization that aims to raise awareness about mental health issues in the cybersecurity community. \r\n\r\nAmanda is on Twitter as @InfoSystir, where she can be found cracking jokes, posting selfies, and expressing her love for hedgehogs.","tagLine":null,"profilePicture":"https://sessionize.com/image/43eb-400o400o1-nSbTW55K3EZCEFxXPGoCW3.jpg","isTopSpeaker":true,"links":[],"sessions":[726674],"fullName":"Amanda Berlin","categoryItems":[],"questionAnswers":[]},{"id":"ee01b4af-c28b-4258-96bf-0ca7102abc84","firstName":"Amanda","lastName":"Molinari","bio":"\r\n  Through a very rewarding career working in various sectors of technology Amanda has finally found her home in the education sector. Getting a start at an ISP in the Bay Area California fifteen years ago opened doors to learn about large datacenter deployments and scaling phased build outs for various projects. After working on network migrations/mergers and redundancy designs with the ISP, and turning up new services with Floyd Medical Hospitals in Georgia an appreciation for new service roll-outs and operations was formed. At UEN the opportunity to draw on those experiences presented itself with a current position as an IT Project Manager over eduroam, circuit turnups and other services. \r\n","tagLine":"UETN IT Project Manager","profilePicture":"https://sessionize.com/image/156a-400o400o1-501e0700-72bc-4eb3-b848-f16bbeaeb208.jpg","isTopSpeaker":false,"links":[],"sessions":[746347],"fullName":"Amanda Molinari","categoryItems":[],"questionAnswers":[]},{"id":"bd7d0a2c-5718-4c76-a713-2e6c91c752e4","firstName":"Andrew","lastName":"Brandt","bio":"Andrew Brandt is a network and malware forensics specialist who works as a principal researcher with Sophos X-Ops, and has a background in investigative journalism. He has been a part of the hacker community most of his life, though he didn't find that community until he first attended Saintcon in 1998. \r\n \r\nIn 2023, he ran for local office to learn what it takes to run a political campaign, specifically so he could bring that knowledge to Saintcon and recruit more people to take the plunge. His campaign slogan was Elect More Hackers, and he adopted a platform that highlighted the unique skill set he would bring to elected office. \r\n \r\nMore than ever, technology issues infuse almost every aspect of our lives, which means they already have penetrated our politics. But many elected officials have a deep disadvantage when confronted with issues surrounding the internet, generative AI, cybersecurity, data privacy, malign social media, internet-driven disinformation, and the threats all these issues introduce to our fragile society. \r\n \r\nBrandt formed the Elect More Hackers organization to level this playing field, by recruiting hacker candidates to run and win office, and to bring the problem-solving skills of hackers to bear on our most pressing concerns.","tagLine":"founder, Elect More Hackers","profilePicture":"https://sessionize.com/image/33a0-400o400o1-XA1Aqg3XqUqQVBrje8XSMC.png","isTopSpeaker":false,"links":[],"sessions":[743241],"fullName":"Andrew Brandt","categoryItems":[],"questionAnswers":[]},{"id":"041cbfa8-1d6a-4c5c-a74e-8c1b3db584ab","firstName":"Andrew","lastName":"Hall","bio":"Professor Andrew Hall, CISSP (@ahall SAINTCON discord) is a seasoned security professional that has most recently been hired as a Professor of Cybersecurity at DAU where he spends his time helping the defense industry learn how to implement cybersecurity.  He loves engineering projects, and has designed many of the SAINTCON minibadges and soldering projects over the years.  He has a bachelors in Electrical Engineering and a MBA.  He is active in many local security groups and organizations, is always looking to help others, progress his career, and build his network.","tagLine":"Andrew Hall, CISSP Professor of Cybersecurity at DAU","profilePicture":"https://sessionize.com/image/b86c-400o400o1-L17wsLFLwrfZksL72CRWmF.jpg","isTopSpeaker":false,"links":[],"sessions":[688010],"fullName":"Andrew Hall","categoryItems":[],"questionAnswers":[]},{"id":"0188cbf4-17cc-441c-8ab5-fe9262df9305","firstName":"Anna","lastName":"Pratt","bio":"Anna Pratt often jokes that she has bytes flowing through her veins. As a security analyst at Brigham Young University, she spearheads incident response initiatives and oversees the development of training programs for emerging cybersecurity professionals. During her undergraduate years, Anna worked within a small team to teach introductory cybersecurity and Capture the Flag (CTF) skills to her peers. She later captained her university’s collegiate cybersecurity team, orchestrating weekly exercises that led her team to regional victory and the national competition. Outside of the cybersecurity realm, you can find Anna on the tennis courts or simply reading a good book.","tagLine":"Security Analyst, Brigham Young University","profilePicture":"https://sessionize.com/image/bff5-400o400o1-4nWNGi6uKHiTYy6WXxsbDj.png","isTopSpeaker":false,"links":[],"sessions":[698055],"fullName":"Anna Pratt","categoryItems":[],"questionAnswers":[]},{"id":"b36a6f1a-3866-45e2-8474-43e18d9ab9a6","firstName":"Ava","lastName":"Petersen","bio":"I’m Ava Petersen, a student at Brigham Young University pursuing an undergraduate degree in cybersecurity. I am extremely passionate about my field of study, and I love the fast-paced and creative aspect of the field which keeps me on my feet and encourages thinking outside the box to solve (or find) problems. Whether through my competitions, research, or work, I am always being challenged in new and exciting ways. You’ll find me everywhere in the cybersecurity competition space under the handle “deltabluejay” and on the BYU Cyberia team.","tagLine":"Student Researcher @ BYU","profilePicture":"https://sessionize.com/image/c616-400o400o1-YLJcV3grxZGy4kGYV5K7a1.jpg","isTopSpeaker":false,"links":[],"sessions":[692268],"fullName":"Ava Petersen","categoryItems":[],"questionAnswers":[]},{"id":"4962c66a-adde-4323-953f-a0696f607acb","firstName":"Branden","lastName":"Ushio","bio":"Branden Ushio is a seasoned cybersecurity expert with over 20 years of experience specializing in K-12 network and security systems. Throughout his career, Branden has been dedicated to enhancing the security landscape within educational institutions, understanding the unique challenges they face in safeguarding sensitive information and ensuring the safety of students and staff.\r\n\r\nPassionate about the intersection of user experience, effective communication, and security, Branden advocates for an integrated approach that prioritizes the end user. He believes that by focusing on user-centric strategies, we can foster a culture of security awareness and encourage the adoption of best practices among students and educators alike.","tagLine":"Granite School District","profilePicture":"https://sessionize.com/image/d768-400o400o1-nNsjqiK6PVPyJLujbDLXfb.jpg","isTopSpeaker":false,"links":[],"sessions":[746261],"fullName":"Branden Ushio","categoryItems":[],"questionAnswers":[]},{"id":"e033693c-a25f-4ad6-846d-113dd9a40e88","firstName":"Brayden","lastName":"Santo","bio":"An engaging and exciting speaker, I am an  Information Security Expert with threat analysis, security operations, and team management experience. I maintain excellent technical communication, creative problem solving, and troubleshooting skills, which gives me a strong ability to speak to the technical level of my audience. Those who have attended my presentations walk away with high value insights and action items to implement immediately!","tagLine":"Sprout Social, Senior Security Engineer","profilePicture":"https://sessionize.com/image/f598-400o400o1-HEmPW3UuUspysaJtt4spwy.jpg","isTopSpeaker":false,"links":[],"sessions":[697970],"fullName":"Brayden Santo","categoryItems":[],"questionAnswers":[]},{"id":"81d57f49-335a-4e96-9f89-b87129326854","firstName":"Brent","lastName":"Dillon","bio":"With over two decades of dedicated experience in the field of cybersecurity and information technology, I am a seasoned leader and practitioner known for my expertise in advancing cybersecurity programs that align with business goals and foster technological innovation. Over the years, I have developed a comprehensive understanding of cybersecurity frameworks and best practices, enabling me to design and implement robust security programs.  Whether it's defending against emerging threats through proactive risk management strategies or fortifying systems with cutting-edge security measures, I have successfully built and maintained highly effective and mature cybersecurity programs.\r\n\r\nOutside of my professional life, I have a deep love for the outdoors. I'm an avid fan of college football and European soccer, and above all I cherish my role as a dad and grandpa. Additionally, I am an avid reader, which allows me to continually expand my knowledge and stay informed about the latest trends and developments in various fields and well as placate my inner nerd with fantasy and sci-fi.","tagLine":"Brent Dillon, Director of Information Security and Compliance for Sportsman's Warehouse","profilePicture":"https://sessionize.com/image/de1e-400o400o1-JXN2cqHx23GpAfkcNe4M1R.jpg","isTopSpeaker":false,"links":[],"sessions":[723949],"fullName":"Brent Dillon","categoryItems":[],"questionAnswers":[]},{"id":"9f2aed4a-d871-4ed0-a39e-b412147284b1","firstName":"Bruce","lastName":"James","bio":"Bruce A. James is the Deputy Chief Information Security Officer for Intermountain Health, an integrated delivery network (IDN) based in Salt Lake City, Utah.\r\n\r\nAs Deputy CISO, Bruce is responsible for Cybersecurity at Intermountain Health, including strategic operations of a group of security teams and functions and for the planning, executing, evaluation, and implementation of enterprise I.S. systems and associated cybersecurity functions.\r\n\r\nBruce has been involved with Information Technology for the past 29 years. Prior to Intermountain Health, Bruce was the Chief Information Security Officer for a Financial Services Technology organization and Lead Software Engineer for an ERP vendor. Bruce has a passion for improving cybersecurity through continuous improvement of tools, processes and technologies.\r\n\r\nBruce is CISSP, CISSP-ISSAP, CISSP-ISSMP, C|EH, CISM and ITIL certified\r\n\r\nBruce is a resident of Utah. Prior to living in Utah, he lived in Tennessee and California. He is married with three children. Bruce received a BS Computer Science from the University of Utah, and MS Information Assurance from Norwich University.","tagLine":"Deputy CISO, Intermountain Health","profilePicture":"https://sessionize.com/image/63fb-400o400o1-XS71BJfcRMYecwzUyNZET7.jpg","isTopSpeaker":false,"links":[],"sessions":[699555],"fullName":"Bruce James","categoryItems":[],"questionAnswers":[]},{"id":"f740cf3b-d4c6-4811-88cc-6eb5fb3fe451","firstName":"Casey","lastName":"Ellis","bio":"Casey is the Founder and Chief Strategy Officer of Bugcrowd, as well as the co-founder of The disclose.io Project. He is a 20+ year veteran of information security who spent his childhood inventing things and generally getting technology to do things it isn't supposed to do. Casey pioneered the Crowdsourced Security as-a-Service model, launching the first bug bounty programs on the Bugcrowd platform in 2012, and co-founded the disclose.io vulnerability disclosure standardization project in 2014 prior to its launch in 2018.\r\n\r\nHe’s an active member of the Cyber Threat Intelligence League, w00w00, and the Hacking Policy Council, and the Election Security Research Fourm, and has personally advised the US White House, Department of Defense, Department of Homeland Security/CISA, the Australian and UK intelligence communities, and various US House and Senate legislative cybersecurity initiatives, including preemptive cyberspace protection ahead of the 2020 Presidential Elections, The US National Cyber Strategy, and a variety of policies and EO’s relating to security research and artificial intelligence.\r\n\r\nCasey, a native of Sydney, Australia, is based in the San Francisco Bay Area.","tagLine":null,"profilePicture":"https://sessionize.com/image/f1bd-400o400o1-NKvRBgYed5825n1M17acH8.jpg","isTopSpeaker":false,"links":[],"sessions":[737947],"fullName":"Casey Ellis","categoryItems":[],"questionAnswers":[]},{"id":"81608789-ffc1-4156-b4ef-14108c90a14b","firstName":"Chandler","lastName":"McClellan","bio":"Cyber Threat Intelligence Engineer | Speaker | Cybersecurity, Data Analytics, and Anticipatory Intelligence Student at USU","tagLine":"CrowdStrike - Advanced Threat Targeted Intrusion Analyst","profilePicture":"https://sessionize.com/image/e6f6-400o400o1-HttZCLXr26oURBwEwY7z8A.jpg","isTopSpeaker":false,"links":[],"sessions":[699604],"fullName":"Chandler McClellan","categoryItems":[],"questionAnswers":[]},{"id":"50948ddc-7a5c-4f36-a38f-8928b4d1e53d","firstName":"Chris","lastName":"Coffelt","bio":"Chris Coffelt works as a deployment systems engineer with Apple. ","tagLine":"Deployment Systems Engineer, Apple Inc. ","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[738851],"fullName":"Chris Coffelt","categoryItems":[],"questionAnswers":[]},{"id":"6b84fa55-e332-49a9-ba9c-aa4b7b5472bc","firstName":"Chris","lastName":"Honda","bio":"Professional Goober-in-Training | Head Janitor and Cook for the Honda Household | Sometimes does Security for Whistic | Bad at Making Jokes and Writing Bios","tagLine":"Manager; Security, Risk, & Compliance @ Whistic | Principal Spreader of Smiles | Teriyaki Chicken Connoisseur","profilePicture":"https://sessionize.com/image/6157-400o400o1-Xyco8S2AYFht9Ur9ZB3qGU.png","isTopSpeaker":false,"links":[],"sessions":[699611],"fullName":"Chris Honda","categoryItems":[],"questionAnswers":[]},{"id":"7f5e5ae7-5b73-4ccd-b2eb-b5647b12d22b","firstName":"Chris","lastName":"Morgan","bio":"Ultimate foodie who's happy to talk restaurants, grilling, smoking (food), exquisite eats, theatre, showtunes, and general nerdery. ","tagLine":"How'd you get your handle? ","profilePicture":"https://sessionize.com/image/5f5f-400o400o1-YTwhkSFxXMckRbPxNzsqFw.png","isTopSpeaker":false,"links":[],"sessions":[755422],"fullName":"Chris Morgan","categoryItems":[],"questionAnswers":[]},{"id":"9d174eea-e362-42f4-be82-9673781330e0","firstName":"Christopher","lastName":"Forte","bio":"Christopher Forte (\"isaidnocookies\") is a security researcher and infrastructure engineer. He holds degrees in computer science and psychology and has various industry certs. Christopher currently runs the DC702 group, the local Las Vegas TOOOL chapter, a security non-profit, and is passionate about community involvement.","tagLine":"Security Researcher","profilePicture":"https://sessionize.com/image/7f84-400o400o1-ErNEss7Q5vmMDNTtjCS43t.jpg","isTopSpeaker":false,"links":[],"sessions":[699442],"fullName":"Christopher Forte","categoryItems":[],"questionAnswers":[]},{"id":"f8dfd609-87df-4d2e-9e94-6f400d60a4aa","firstName":"Cody","lastName":"Spendlove","bio":null,"tagLine":null,"profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[756249],"fullName":"Cody Spendlove","categoryItems":[],"questionAnswers":[]},{"id":"37fc132d-0b1b-4b0c-a8fe-821eeef6c9e6","firstName":"Corey","lastName":"Ball","bio":"Corey Ball is a cybersecurity consulting manager at Moss Adams, where he leads its penetration testing services. He has over ten years of experience working in IT and cybersecurity across several industries, including aerospace, agribusiness, energy, financial tech, government services, and healthcare. In addition to a bachelor’s degree in English and philosophy from Sacramento State University, Corey holds the OSCP, CCISO, CISSP, and several other industry certifications.","tagLine":"Author of Hacking APIs","profilePicture":"https://sessionize.com/image/5eba-400o400o1-Wi1zrdwVGVACMN1PrTZ66g.jpg","isTopSpeaker":false,"links":[],"sessions":[721571],"fullName":"Corey Ball","categoryItems":[],"questionAnswers":[]},{"id":"b5440e39-8f72-4eb1-b9eb-5dad154cd309","firstName":"Daniel","lastName":"Dayley","bio":"Daniel Dayley is a Network Security Engineer at Qualtrics. Daniel was perviously an infrastructure security engineer for Sling TV and Utah Valley University. Daniel enjoys building and securing automated infrastructure, self-hosting applications, and working on projects with microcontrollers. ","tagLine":"Network Security Engineer at Qualtrics","profilePicture":"https://sessionize.com/image/98ce-400o400o1-QvWnwgJGzjAmEHJjGJnqsE.png","isTopSpeaker":false,"links":[],"sessions":[699412],"fullName":"Daniel Dayley","categoryItems":[],"questionAnswers":[]},{"id":"9ff61bba-4e21-4846-b6b9-79c309ed3f29","firstName":"Danny","lastName":"Howerton","bio":"Come talk to me about Cyber Offensive techniques, 90's-00's Japanese sports cars, Denver NFL/NHL teams, or 16th Century Japan.  ","tagLine":"Doer of things","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[698940,695911],"fullName":"Danny Howerton","categoryItems":[],"questionAnswers":[]},{"id":"20a81b6a-720c-4946-b433-bce19fdffc03","firstName":"Dave","lastName":"Bogle","bio":"Dave has been working in cybersecurity for nearly a decade. At Red Canary he focuses on security research for Google Cloud Platform (GCP), kubernetes, and all things Linux. He works closely with engineering teams, detection engineers, threat hunters, and others to leverage and operationalize his research across the company’s portfolio of products. He has a passion for diving deep into the inner workings of operating systems and cloud service providers and applies that knowledge to his research.","tagLine":"Principal Threat Researcher at Red Canary","profilePicture":"https://sessionize.com/image/9682-400o400o1-GHmUmJXs1kf287a5BrMz2r.jpg","isTopSpeaker":false,"links":[],"sessions":[686986],"fullName":"Dave Bogle","categoryItems":[],"questionAnswers":[]},{"id":"00c7e8e9-e1ba-4c5a-815f-bacab3a8406b","firstName":"Dave","lastName":"Kennedy","bio":"David Kennedy, is the founder of two highly successful and renowned global cybersecurity companies Binary Defense and TrustedSec and is considered an industry leader in cybersecurity.\r\n \r\nAs the former Chief Security Officer of Diebold Incorporated, he led large global cybersecurity teams and built a world-class security organization. Recognized as a top professional, David has testified before Congress, continuously shapes cyber security policy, and provides expert analysis on national news outlets.\r\n \r\nMost notably, he advised on the TV show \"Mr. Robot,\" to provide real-world hacking insights to the Emmy winning drama series.\r\n \r\nAs a founding author of the Penetration Testing Execution Standard (PTES), he played a pinnacle role in shaping the penetration testing and offensive security industry. David is known as the catalyst that started PowerShell security and has authored widely popular tools like the Social-Engineer Toolkit as well as countless open-source frameworks, security advisories, and zero-day research.\r\n \r\nDavid was one of the founders of DerbyCon - a conference that spanned nine years and was one of the industry’s most popular cybersecurity conferences. David also co-authored the number one best-selling cybersecurity book on hacking and exploitation techniques.\r\n \r\nDavid is a proud Marine, served in the intelligence community, and was deployed several times to Iraq and other countries. In David's spare time, he focuses on family first, fitness, co-hosting the \"Hacking Your Health Podcast,\" and enjoys a passion for gaming. He even built a movie-accurate DeLorean time machine, inspired by his favorite film, Back to the Future.\r\n \r\nDavid's life mission is to help others and to make the world a safer place in cybersecurity which drives him every single day.","tagLine":null,"profilePicture":"https://sessionize.com/image/6d33-400o400o1-TB12uCqAuwfB9vNykE11qi.jpg","isTopSpeaker":true,"links":[],"sessions":[725439],"fullName":"Dave Kennedy","categoryItems":[],"questionAnswers":[]},{"id":"6f597031-dc92-4b21-90d2-3dc7f78bca46","firstName":"Dave","lastName":"N/A","bio":"I speak. therefore I am.  I think that's what it said... but I'd have to google it to be sure","tagLine":"University of Utah. IAM Team","profilePicture":"https://sessionize.com/image/4d53-400o400o1-aUyChu7dEZEKLzUtUxF4g6.jpg","isTopSpeaker":false,"links":[],"sessions":[720952],"fullName":"Dave N/A","categoryItems":[],"questionAnswers":[]},{"id":"a7a91a3b-3254-4dfd-9e42-721d8ccf4b7a","firstName":"David","lastName":"Bowman","bio":"David leads a cybersecurity program for one of the largest school districts in Utah. Serving 8,500 staff , 57,000 students. Once you count up all of the devices it’s over 100,000 from Chromebooks to servers to pc’s to MAC. David presents at UETN and Saintcon each year and is always happy to share with others how he’s succeeding in fighting off the bad guys.","tagLine":"Blue Team Leader ","profilePicture":"https://sessionize.com/image/c90a-400o400o1-hNZhASBDMYgApzJDMfiAdb.jpg","isTopSpeaker":false,"links":[],"sessions":[685422,735509,738851],"fullName":"David Bowman","categoryItems":[],"questionAnswers":[]},{"id":"e33f4f3a-0dbf-4b78-ac28-b570d4267e3d","firstName":"David ","lastName":"Long","bio":"David Long has now served over five years as superintendent.  Prior to moving to Beaver, he served as the Technology Director in the Logan City School District for several years.  He has been on the UETN board for over a decade and stays active with national technology organizations like CoSN and the CDE K12 Virtual Council.  The Beaver County School District has implemented a Private LTE Network to better connect student device and address privacy concerns as technology continues to develop in the Age of AI.","tagLine":"Superintendent, Beaver County School District","profilePicture":"https://sessionize.com/image/548a-400o400o1-PcHNq2oy2hPVHhPfsjQcUZ.jpg","isTopSpeaker":false,"links":[],"sessions":[756249],"fullName":"David Long","categoryItems":[],"questionAnswers":[]},{"id":"91d62c8f-d6b0-4903-84f0-b37d362962da","firstName":"Derek","lastName":"Gray","bio":"CISSP\r\nMS Cybersecurity & Information Assurance from Southern Utah University\r\nSr Cyber Security Analyst for Lucid Software\r\nPublished RPG Adventure Author and Game designer","tagLine":"Sr Security Analyst - Lucid Software - ","profilePicture":"https://sessionize.com/image/a35f-400o400o1-QgMaRmDLkUt67Uw9P6mxsu.png","isTopSpeaker":false,"links":[],"sessions":[698154],"fullName":"Derek Gray","categoryItems":[],"questionAnswers":[]},{"id":"9b493d47-18ca-4d91-98b6-ebce7435b31d","firstName":"Devin","lastName":"Shelley","bio":"Devin Shelley has been in the InfoSec field for 20 years, he lead the Utah Army National Guard defensive cyber operations (DCO) team for 8 years before retiring from the military in 2020. ","tagLine":"Sr. Manager Information Security at O.C. Tanner","profilePicture":"https://sessionize.com/image/c5e8-400o400o1-3RJKyfftzxh7qWU4KmZfVw.jpg","isTopSpeaker":false,"links":[],"sessions":[692498],"fullName":"Devin Shelley","categoryItems":[],"questionAnswers":[]},{"id":"cdab35d4-838c-483a-89da-76e6b19407ce","firstName":"Eddie","lastName":"Miro","bio":"Eddie Miro is a Cybersecurity Analyst at Cyber Skyline. Eddie has presented at DEF CON, HOPE, Wild West Hackin’ Fest, Antisyphon Training, SaintCon, B-Sides and many virtual conferences. He specializes in training, education, physical security, and social engineering. Eddie also organizes Octopus Game, an official DEF CON contest.","tagLine":"Cybersecurity Analyst at Cyber Skyline | Red Team Consultant - Miro Labs","profilePicture":"https://sessionize.com/image/aaf7-400o400o1-Dy79mD85QAYk55o8Dm6aC6.jpg","isTopSpeaker":false,"links":[],"sessions":[722883],"fullName":"Eddie Miro","categoryItems":[],"questionAnswers":[]},{"id":"d438ce0f-caa8-49e1-93d9-31b2ace0d991","firstName":"Ernie","lastName":"Lemke","bio":"Mr. Lemke is a security and technology specialist with broad experience in state government, large corporations, and small businesses. He has been an Information Security professional for more than 25 years. He has been a CISO or acting CISO for several California State Agencies.","tagLine":"Solution Engineer for Zscaler Public Sector","profilePicture":"https://sessionize.com/image/73e3-400o400o1-Q2xsPMaTTs2apuwceKkzDz.jpg","isTopSpeaker":false,"links":[],"sessions":[766818],"fullName":"Ernie Lemke","categoryItems":[],"questionAnswers":[]},{"id":"8e4aad55-4780-44a4-a387-176ca2a9505d","firstName":"Gerrit","lastName":"Gerritsen","bio":"I am an offensive security engineer at Vasion, where I manage all internal testing, the red team, security training, and external testing. I have a MS in Cybersecurity and Information Assurance and hold a CISSP. I have experience working for various organizations, ranging from the USAF to non-profits. ","tagLine":"Red teaming, demystified","profilePicture":"https://sessionize.com/image/6878-400o400o1-YHHr1WeaDsxzeU4qf65Vyf.jpg","isTopSpeaker":false,"links":[],"sessions":[698935],"fullName":"Gerrit Gerritsen","categoryItems":[],"questionAnswers":[]},{"id":"ab4cffda-24cf-4c8b-897e-262459f5b054","firstName":"Greg","lastName":"Fitzgerald","bio":"Greg Fitzgerald is a serial entrepreneur and public market senior executive bringing next generation technologies into the cybersecurity market.  For over 20 years, he has been the founder, founding executive, or key senior executive of what are now the biggest brand names in the cybersecurity industry.   Known as a market-maker, Mr. Fitzgerald serves as the Co-founder/President of Sevco Security, a cloud based security threat exposure management platform company and CEO & Chairman of Cyberforce Security LLC, a global distributor of next generation cybersecurity products.  He was founding Chief Marketing Officer at Cylance, Inc., the first A.I. based endpoint security in the market.  His leadership specializes in driving a company's strategic positioning, brand, field engagement, and product go-to-market. ","tagLine":"Co-founder/President of Sevco Security","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[698925],"fullName":"Greg Fitzgerald","categoryItems":[],"questionAnswers":[]},{"id":"cc9d094a-8762-481d-8c57-6cda578c5bca","firstName":"Isaac","lastName":"Painter","bio":"Isaac has worked in the cyber security industry for ~16 years. He currently works for Aumni, a JP Morgan company, as the Head of IT & Security. ","tagLine":"Isaac Painter, Head of IT & Security at Aumni","profilePicture":"https://sessionize.com/image/b8cb-400o400o1-YKR24oZGnxpaeeypMtmxEr.jpg","isTopSpeaker":false,"links":[],"sessions":[722035],"fullName":"Isaac Painter","categoryItems":[],"questionAnswers":[]},{"id":"9f6278b9-8e2a-4359-a382-fb020d3b6eba","firstName":"Jack ","lastName":"Hendrickson","bio":"Jack has been working within the school landscape for the last 15 years. First in the classroom, then into the curriculum development and coaching side, moving to assistive technology, the ecosystem of apps and educational tools, and most recently into the technology department & cybersecurity side with ManagedMethods. Based in Portland, OR, he is typically found chasing his two daughters around the park and the trails, or chasing the puck around a hockey rink. \r\nConnect with Jack on LinkedIn: https://www.linkedin.com/in/jackhendrickson ","tagLine":"ManagedMethods, Account Executive for Western Region","profilePicture":"https://sessionize.com/image/a30e-400o400o1-wMv6CntXQuhCRJLrbqfUod.png","isTopSpeaker":false,"links":[],"sessions":[696862],"fullName":"Jack Hendrickson","categoryItems":[],"questionAnswers":[]},{"id":"e910ded0-5dae-447b-ba3e-10182cc7f745","firstName":"Jack ","lastName":"Rhysider","bio":"Jack Rhysider, host and creator of the award winning podcast Darknet Diaries, is a veteran to the security world. He gained his professional knowledge of security by working in a Security Operations Center for a Fortune 500 company, a place to where threats are detected and stopped.","tagLine":null,"profilePicture":"https://sessionize.com/image/f5d2-400o400o1-V63CpDyB8gEaLUfydqxpEH.jpg","isTopSpeaker":true,"links":[],"sessions":[726676],"fullName":"Jack Rhysider","categoryItems":[],"questionAnswers":[]},{"id":"62d4d1ea-9166-40ea-a212-b073f5dc4b17","firstName":"Jake","lastName":"Bernardes","bio":"A seasoned security leader with significant experience as both a consultant & CISO. Having worked, & lived, all over the world working as a consultant, vCISO, CISO & Advisor I've learned a lot about a little or a little about a lot. A specialist in GTM motions for security focussed products with deep experience in supporting international companies in breaking in to the US market.","tagLine":"CISO, vCISO, Advisor, Speaker","profilePicture":"https://sessionize.com/image/3875-400o400o1-GCsDML4f1pJcks5uPgvfnR.jpg","isTopSpeaker":false,"links":[],"sessions":[720673],"fullName":"Jake Bernardes","categoryItems":[],"questionAnswers":[]},{"id":"876d5487-271f-430a-8da2-00f69cd99e46","firstName":"Jake","lastName":"Williams","bio":"Jake Williams (aka MalwareJake) is a seasoned security researcher with decades of experience in the technology and security industries. Jake is a former startup founder, former senior SANS instructor and course author, and an intelligence community and military veteran. He loves forensics, incident response, cyber threat intelligence, and offensive methodologies. Today, Jake is an IANS faculty member, VP of R&D at Hunter Strategy, independent security consultant, and is performing security-focused research to benefit the broader community. He has twice won the DoD Cyber Crime Center (DC3) annual digital forensics challenge and is the recipient of the NSA Exceptional Civilian Service Award.","tagLine":" MalwareJake","profilePicture":"https://sessionize.com/image/ba73-400o400o1-4WEbrEgiJGtwVmsQZPaUwN.jpg","isTopSpeaker":false,"links":[],"sessions":[737949],"fullName":"Jake Williams","categoryItems":[],"questionAnswers":[]},{"id":"2ef38a62-4bad-4ba8-9e79-9d9d5450eb7b","firstName":"Jared","lastName":"Hallows","bio":"Jared is the IT Director at Wayne School district. ","tagLine":"Technology Director, Wayne School District","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[735509],"fullName":"Jared Hallows","categoryItems":[],"questionAnswers":[]},{"id":"db5436d4-1a4d-480e-a910-efa9e9b7c62d","firstName":"Jason","lastName":"Gurr","bio":null,"tagLine":null,"profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[720942],"fullName":"Jason Gurr","categoryItems":[],"questionAnswers":[]},{"id":"da0ea4e0-3b07-41a1-92cc-16b561e01e39","firstName":"Jason","lastName":"Gurr","bio":"Jason is a network specialist with Iron School District. ","tagLine":null,"profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[735509],"fullName":"Jason Gurr","categoryItems":[],"questionAnswers":[]},{"id":"6dfed1df-1e50-4b8b-884d-b63cf81eaa46","firstName":"Jason","lastName":"Udy","bio":"Jason has been involved with computers since he was little.  He started learning to program in basic on his family's Apple //e.  \r\nHis teenage years brought him into the world of BBS's where he managed one that \"traded\" games.  The BBS also processed usenet and TradeWars 2002.  \r\nHe ventured into the network and server side of information technology early in his career.  After working as a network and computer tech at a medical lab and then a major warehouse in the Salt Lake Valley, he landed a job at Davis School District as a Network Engineer.  Shortly after starting this position, a dedicated Cybersecurity Engineer position opened up at the district, in which he was able to move to.  Jason has been involved in cybersecurity at Davis School District for the past 17 years.\r\n","tagLine":"Sr. Cybersecurity Evangelist and Defender of the Realm - Davis School District","profilePicture":"https://sessionize.com/image/df86-400o400o1-GaAhqSZxAQPcjQQbTHoXKs.jpg","isTopSpeaker":false,"links":[],"sessions":[720210],"fullName":"Jason Udy","categoryItems":[],"questionAnswers":[]},{"id":"77f87122-a3c3-4526-8252-cb686cf426b9","firstName":"Jeremy","lastName":"Cox","bio":"Husband, Father, Latter-day Saint, Outdoorsman, DJ & All Around Security Geek.","tagLine":"Chief Information Officer of Washington County School District","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[735509,688155],"fullName":"Jeremy Cox","categoryItems":[],"questionAnswers":[]},{"id":"ebd588b5-9389-4ee3-a23f-711a28599296","firstName":"Jess","lastName":"Chang","bio":"Jess Chang is a Member of Program Staff on the Security team at OpenAI, where she focuses on defense and intelligence initiatives. Prior to OpenAI, she was a Staff Security Technical Program Manager at Vanta, where she worked on security, privacy, and enterprise engineering efforts, and led product efforts in security and privacy education. She has also held roles as a Senior Technical Program Manager and Senior Behavioral Security Engineer at Robinhood, where she advised product and engineering teams on trust & safety product abuse risks and incorporated behavioral science principles toward user adoption of positive security and account safety practices. Jess began her career at Dropbox, where she led key trust and security programs, and has presented numerous talks for global security conferences and industry organizations, peer companies, and federally-funded research centers. ","tagLine":"Member of Program Staff, Security - OpenAI","profilePicture":"https://sessionize.com/image/01f4-400o400o1-N2Va1gBsCmxs35oPv5pq7A.png","isTopSpeaker":false,"links":[],"sessions":[699099],"fullName":"Jess Chang","categoryItems":[],"questionAnswers":[]},{"id":"a0114df1-5083-49ac-8f42-798be5cb3190","firstName":"John","lastName":"Dwyer","bio":"John (@TactiKoolSec) brings 15+ years of security and technology experience, with an extensive background in incident response, threat hunting, security thought leadership, and adversary operational analysis.\r\n\r\nCurrently, John is the Director of Security Research and Head of ARC Labs at Binary Defense where he lead research and development initiatives to improve Binary Defense product and services as well as threat research to develop meaningful insights and trends for the security community.\r\n\r\nPrior to Binary Defense, John spent time at IBM X-Force, MIT Lincoln Laboratory, as well as Carnegie Mellon’s Software Engineering Institute.","tagLine":"Binary Defense, Directory of Security Research","profilePicture":"https://sessionize.com/image/8434-400o400o1-XSdgKZy2NKyR5WGaX2kd4y.jpg","isTopSpeaker":false,"links":[],"sessions":[716721],"fullName":"John Dwyer","categoryItems":[],"questionAnswers":[]},{"id":"d964337c-bbdd-427c-bafb-f779746ac62f","firstName":"John","lastName":"Gillis","bio":"I have been in Cyber Security for the past 7 years working at FireEye/Mandiant, Arctic Wolf, CrowdStrike, and Adobe. I specialize in tool building and EDR.","tagLine":"Sr. Security Analyst @ Adobe","profilePicture":"https://sessionize.com/image/d177-400o400o1-w3pADBMJfSuZjKsoz4rZuF.jpg","isTopSpeaker":false,"links":[],"sessions":[724835],"fullName":"John Gillis","categoryItems":[],"questionAnswers":[]},{"id":"b5b91a8e-e669-42ec-9c94-2a28c145a806","firstName":"Joseph","lastName":"Fidler","bio":"From spending a long time as a consumer of security talks and learning a lot from them, to daily-driving linux, running a youtube channel with a slight focus on tech, Joseph has had a lot to learn from failure on his part and that of others. Cybersecurity has been a fascination for a long time and one of those areas that has been a challenge to figure out how to get started in, without certifications or a good enough income or time, depending on the time period, to get them figured out. A lot of this has lead to lack in confidence in getting started in the field. Since going through the IT & Cybersecurity program at Bridgerland Technical College, he has not only learned he can hold his own in dealing with those who have experience in the field, but has been able to get CompTIA certs that have available in their progrem. And the internship he took during his time there has only boosted that confidence even more. Still continuing learning, trying to keep up on changes and new situations in the wild, he is also working on getting his foot in the door for Ag IT and Cybersecurity and developing systems to aid smaller farm operations to improve their workflow.","tagLine":"Your farm's IT guy","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[722750],"fullName":"Joseph Fidler","categoryItems":[],"questionAnswers":[]},{"id":"023083a5-01a6-45fb-854a-7e022bd030c9","firstName":"Josh","lastName":"Galvez","bio":"Zevlag has ran the Hackers Challenge for 7 years.","tagLine":"zevlag - Hackers Challenge GameMaster","profilePicture":"https://sessionize.com/image/5002-400o400o1-apE9SAg3jqpjD9f53d8q9A.png","isTopSpeaker":false,"links":[],"sessions":[740142],"fullName":"Josh Galvez","categoryItems":[],"questionAnswers":[]},{"id":"947caee7-c202-4beb-a094-fd1adbca9573","firstName":"Justin","lastName":"Applegate","bio":"Justin Applegate graduated with his Bachelors in Cybersecurity from BYU in Fall 2024 and is currently studying as a graduate student at BYU. He is a SAINTCON black badge holder from winning the Hacker's Challenge in 2023. He is currently on scholarship with the Department of Defense and aims to be a security researcher in his future career. ","tagLine":"Grad Student @ BYU","profilePicture":"https://sessionize.com/image/b045-400o400o1-9t8nrXPM6ntsFjBaPpvfFL.png","isTopSpeaker":false,"links":[],"sessions":[692268],"fullName":"Justin Applegate","categoryItems":[],"questionAnswers":[]},{"id":"149ef35b-9b8e-4c1e-a4e1-d224fbe85233","firstName":"Katherine","lastName":"Rackliffe","bio":"Katherine is a undergraduate cybersecurity student at Brigham Young University.","tagLine":"Brigham Young University","profilePicture":"https://sessionize.com/image/f0b7-400o400o1-7uZfUtB5nbAgRmVcHuRbKK.jpg","isTopSpeaker":false,"links":[],"sessions":[721632],"fullName":"Katherine Rackliffe","categoryItems":[],"questionAnswers":[]},{"id":"9eada925-a9b2-430d-bda0-6709167631e4","firstName":"Ken","lastName":"Munford","bio":"Ken is a Director of Information Technology with Iron School District. ","tagLine":null,"profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[735509],"fullName":"Ken Munford","categoryItems":[],"questionAnswers":[]},{"id":"150bf0e3-9d48-4d23-b0b4-bad04c2247d4","firstName":"Kim","lastName":"Elias","bio":"Kim is a Senior Compliance Specialist at Vanta, responsible for managing internal compliance and privacy. She’s worked for the last 6 years in the world of GRC and security, spending the majority of her time helping start-ups grow their compliance from the ground up. She feels passionately that everyone in the cybersecurity world should write a policy at some point in their career - for the learning experience.","tagLine":"Senior Compliance Specialist @ Vanta ","profilePicture":"https://sessionize.com/image/1979-400o400o1-NWzYmLQ7gXwSL3c3BXHSyu.jpg","isTopSpeaker":false,"links":[],"sessions":[699099],"fullName":"Kim Elias","categoryItems":[],"questionAnswers":[]},{"id":"fa9588b9-098c-408a-8514-b24d6368f379","firstName":"Landon","lastName":"Rice","bio":"18 y/o Threat Researcher for RedSense Intelligence, also a guy that eat sleeps and drinks offensive security, generally in the physical/malware realms.","tagLine":"Threat Researcher + Red Teamer Wannabe","profilePicture":"https://sessionize.com/image/d4ee-400o400o1-76W6Q7uHpvywYVGuk3cvQw.jpg","isTopSpeaker":false,"links":[],"sessions":[725424],"fullName":"Landon Rice","categoryItems":[],"questionAnswers":[]},{"id":"a4425c1f-5350-400c-afcd-f04719dbdec5","firstName":"Leah M","lastName":"Olson, CISSP","bio":"Leah Olson has served as a leader of technology teams in highly regulated industries for over 20 years and enjoys calling northern Michigan her home. She has a unique background in information systems paired with a business marketing degree, which has provided a foundation to help businesses grow in a well-planned, stable, scalable, secure technology environment. After leaving her position as vice president of technology and marketing at a private bank, she started N Point Strategies, where her team works with businesses and organizations in critical infrastructure to establish and develop security programs. \r\n\r\nLeah currently holds the role of supervisor of business security and IT support at Great Lakes Energy, Michigan’s largest electric and fiber services cooperative. She has grown the physical, cyber, and operational security environment for the coop since 2019. Leah has extensive knowledge of the National Institute of Standards and Technology (NIST) security framework, federal regulations such as NERC CIP, FFIEC regulations, HIPAA and privately regulated industries including the Payment Card Industry (PCI) . She has been a member of the NRECA Cyber Security Member Advisory Group (CS-MAG) since early 2022 and sits on the executive team for several other organizations in her area. \r\n","tagLine":"N Point Strategies, CEO","profilePicture":"https://sessionize.com/image/6712-400o400o1-Tk7V47Nus63doBd48kYnwj.jpg","isTopSpeaker":false,"links":[],"sessions":[691567],"fullName":"Leah M Olson, CISSP","categoryItems":[],"questionAnswers":[]},{"id":"7f867679-2ee8-485e-abe8-caaa000634c0","firstName":"Lenin","lastName":"Alevski","bio":"Lenin Alevski is a Full Stack Engineer and generalist with a lot of passion for Information Security. Currently working as a Security Engineer at Google. Lenin specializes in building and maintaining Distributed Systems, Application Security and Cloud Security in general. Lenin loves to play CTFs, contributing to open-source and writing about security and privacy on his personal blog https://www.alevsk.com.","tagLine":"Security Engineer at Google","profilePicture":"https://sessionize.com/image/0959-400o400o1-DFb5ubaDbRmGETP3bc44Ny.jpg","isTopSpeaker":false,"links":[],"sessions":[725303],"fullName":"Lenin Alevski","categoryItems":[],"questionAnswers":[]},{"id":"8de70a21-f8ca-4bc2-b30d-5b46d4d0101f","firstName":"Madeline ","lastName":"Kaye","bio":"Madeline has always had a \"what-if\" mindset that drew her to learn more about pentesting when she was a teenager. As an extrovert, she decided to pursue a career in the legal industry at first, but after realizing how much of her free time was spent coding and re-engineering devices, she switched to a career in cybersecurity. Her mission is to increase security awareness through demonstrations, and show individuals and businesses how to easily defend valuable assets. Because of her experience, she has been recruited by Superior Court of California, Microsoft, and The State of Utah to name a few, where her passion and knowledge only grew more. Her training and management experience has helped her understand individuals' thought processes, and be able to explain complex topics to anyone at any technical level.","tagLine":"Consultant; Geek","profilePicture":"https://sessionize.com/image/8d11-400o400o1-DiGSUbJJxo2z6PD5moga7P.png","isTopSpeaker":false,"links":[],"sessions":[683218],"fullName":"Madeline Kaye","categoryItems":[],"questionAnswers":[]},{"id":"85ddf61a-a2ab-4a5c-9b89-ea3ccf8bc975","firstName":"Mark","lastName":"Hoopes","bio":"Mark Hoopes has been an Application Pentester for more than 10 years and has worked in enterprise IT for more than 20.  He has presented at multiple conferences as a speaker and instructor.  He was sucked into the security industry by a CTF and continues to be a strong proponent of hands-on training.  ","tagLine":"Managing Principal, Meristem InfoSec","profilePicture":"https://sessionize.com/image/b6c3-400o400o1-PnBr5xAEocMBfBRwCHKmWw.jpg","isTopSpeaker":false,"links":[],"sessions":[689642],"fullName":"Mark Hoopes","categoryItems":[],"questionAnswers":[]},{"id":"a1d037c1-a328-4dd3-b90f-0bdc82c7ebb3","firstName":"Matt","lastName":"Durrin","bio":"Matt Durrin is the Director of Training and Research at LMG Security and a Senior Consultant with the organization. He is an instructor at the international Black Hat USA conference, where he has taught classes on ransomware and data breaches. Matt has conducted cybersecurity seminars, tabletop exercises and classes for thousands of attendees in all sectors, including banking, retail, healthcare, government, and more. He is also the co-author of a new book, Ransomware and Cyber Extortion: Response and Prevention. A seasoned cybersecurity and IT professional, Matt specializes in ransomware response and research, as well as deployment of proactive cybersecurity solutions. Matt holds a bachelor’s degree in computer science from the University of Montana, and his malware research has been featured on NBC Nightly News.","tagLine":"Director of Training and Research, LMG Security","profilePicture":"https://sessionize.com/image/4dfd-400o400o1-pycyCJEbx3euhSCnFD9Hwe.jpg","isTopSpeaker":false,"links":[],"sessions":[699404],"fullName":"Matt Durrin","categoryItems":[],"questionAnswers":[]},{"id":"563efcc3-e4f9-4477-bd42-3f76c4d495eb","firstName":"Matt","lastName":"Winters","bio":"Matthew Winters is the AI Education Specialist at Utah State Board of Education (USBE). He was also the Utah Coalition for Educational Technology (UCET) President for 2022-2024, our Utah ISTE affiliate. He was one of the International Society for Technology in Education’s 20 to Watch in 2023 and Tech & Learning’s Best Example of Professional Development. He is a former English Language Arts teacher at the secondary and college level. He has been a podcaster for six years, first with Edtrex Rewind and The UCET Podcast and then with UEN Homeroom and ISTE’s The Edge. He loves stories, creativity, and technology, and the intersections where all three topics grow together. ","tagLine":"Utah State Board of Education","profilePicture":"https://sessionize.com/image/84b7-400o400o1-49Z2k5RrfuD6UngnrExxo9.jpg","isTopSpeaker":false,"links":[],"sessions":[739844],"fullName":"Matt Winters","categoryItems":[],"questionAnswers":[]},{"id":"2793735c-b54c-46b8-9949-ffb380a46a1a","firstName":"Michael","lastName":"Allred","bio":"Michael Allred, a seasoned Cybersecurity advocate, brings over 25 years of experience in the field. His expertise lies in Cybersecurity and Identity and Access Management (IAM). Key highlights:\r\nIAM Visionary: Michael firmly believes that identity is the bedrock of any robust cybersecurity program.\r\nIntermountain Health Journey: Previously with Intermountain Health, he led the IAM program, shaping strategy, architecture, and implementation.\r\nCollaboration Champion: Michael excels at fostering collaboration and driving program execution.\r\nPatient-Centric Approach: Leveraging IAM, he enhances patient experiences and outcomes.\r\nUnified Identity Advocate: Passionate about creating a unified identity foundation for organizations.\r\nIdentity Data Fabric: Michael champions the power of an identity data fabric, enabling secure converged identity platforms.","tagLine":"IAM Though Leader |Healthcare Identity Leader | Cybersecurity Expertise | CISSP, CISM","profilePicture":"https://sessionize.com/image/5a94-400o400o1-sE9VAk4vE4DMQMrb8KCXT1.png","isTopSpeaker":false,"links":[],"sessions":[719682],"fullName":"Michael Allred","categoryItems":[],"questionAnswers":[]},{"id":"75f98fd2-2cef-47e9-90db-fd14f90d784e","firstName":"Michael","lastName":"Fischer","bio":"Life long student and learner that arrived in security after a lengthy sting as a Software Engineer.","tagLine":"Sr. Director Information Security, Arctic Wolf","profilePicture":"https://sessionize.com/image/ced3-400o400o1-XNzrfvkSL9gYLkaGwnB8Sy.png","isTopSpeaker":false,"links":[],"sessions":[719017],"fullName":"Michael Fischer","categoryItems":[],"questionAnswers":[]},{"id":"44651b54-aaa1-4643-bf33-f956414d2b77","firstName":"Michael","lastName":"Whiteley","bio":"Badges? We don't need no stinking badges!","tagLine":"MK Factor","profilePicture":"https://sessionize.com/image/4118-400o400o1-nsXBkGMvPEHxUC676rQZJ5.png","isTopSpeaker":false,"links":[],"sessions":[680173],"fullName":"Michael Whiteley","categoryItems":[],"questionAnswers":[]},{"id":"c710a865-5da9-4f65-ba60-6ca1c99d21a4","firstName":"Mike","lastName":"Venturelli","bio":"Incident Response & Threat Hunting Engineer with experience in large and small health systems. Enjoy going to jam band live music all over the globe! ","tagLine":"Staff IR & Threat Hunting Engineer - Henry Schein One","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[697827],"fullName":"Mike Venturelli","categoryItems":[],"questionAnswers":[]},{"id":"9c72f818-04d9-4ca4-b048-181dcd885b3e","firstName":"Naomi","lastName":"Brockwell","bio":"Naomi Brockwell is a tech journalist, author of the book “Beginner's Introduction To Privacy”, and creator of NBTV.media.\"\r\n\r\nNBTV teaches people how to reclaim control of their lives in the digital age. The channel gives people the tools they need to take back their data, money, and free online expression. They have almost 1 million subscribers across platforms, and over 63 million views. ","tagLine":null,"profilePicture":"https://sessionize.com/image/1b42-400o400o1-KLaWidcEgf4SPq6noMdRy.jpg","isTopSpeaker":false,"links":[],"sessions":[725436],"fullName":"Naomi Brockwell","categoryItems":[],"questionAnswers":[]},{"id":"adc8b351-8a1e-4b6f-9b3a-15f3f6629e9f","firstName":"Noah","lastName":"Pack","bio":"Noah Pack is a penetration tester that runs a 3D printing and consulting business. He has hundreds of downloads on his CAD models from websites like Printables and Maker World. Noah holds infosec certifications from GIAC, CompTIA, (ISC)2, and AWS.","tagLine":"Penetration Tester @ Webcheck Security & Owner @ JPID Engineering","profilePicture":"https://sessionize.com/image/c8b0-400o400o1-R3mu3HSGsu5saQUue7C9Nj.png","isTopSpeaker":false,"links":[],"sessions":[689315],"fullName":"Noah Pack","categoryItems":[],"questionAnswers":[]},{"id":"25374725-93db-4878-beee-8c37ce1118f9","firstName":"Paul","lastName":"Keener","bio":"Paul Keener - Professional Bio\r\n\r\nPaul Keener is a seasoned cybersecurity professional based in Las Vegas, NV, currently serving as a Field CISO for GuidePoint Security's SouthWest Region. With extensive experience in ISP class operations, risk management, policy writing, and incident response, Paul excels in aligning cybersecurity initiatives with business objectives to mitigate threats and safeguard critical assets.\r\n\r\nPreviously, as the Senior Vice President and Head of Cybersecurity Operations at City National Bank, Paul led a team of 16, expanding the team and achieving perfect scores in multiple audits and regulatory exams. His leadership in cybersecurity operations significantly enhanced the bank's defense strategies.\r\n\r\nPaul's earlier role as Director of Cybersecurity Operations at Viasat, Inc. saw him managing cybersecurity for critical services, including US Government and DoD operations. He established Red Team capabilities and developed new managed security services.\r\n\r\nIn the United States Marine Corps, Paul held key positions such as Cyber Developmental Test and Engineering Lead and Red Team Officer in Charge. He managed large teams, conducted sophisticated cyber operations, and developed training programs, contributing to the security and efficiency of military communications.\r\n\r\nPaul has also contributed to academia as an Adjunct Professor at the University of San Diego, teaching courses in Digital Forensics, Incident Response, and Cyber Intelligence. He instructed reserve officers in professional military education at the Marine Corps University.\r\n\r\nHe holds a Master’s in Military Studies from Marine Corps University and a Bachelor of Arts in Political Science from the University of California, San Diego. Paul is a US citizen, eligible for TS/SCI clearance, and is certified in Security+ and Marine Corps Red Team Level 1.\r\n\r\n**Contact Information:**\r\n- Email: paul.keener@icloud.com\r\n- LinkedIn: [Paul Keener](https://www.linkedin.com/in/paulkeener/)\r\n- Phone: 540-207-8975","tagLine":"Field CISO, SOC Enthusiast ","profilePicture":"https://sessionize.com/image/2825-400o400o1-P97dqZzXtGQqBvhuYiLTMJ.jpg","isTopSpeaker":false,"links":[],"sessions":[699512],"fullName":"Paul Keener","categoryItems":[],"questionAnswers":[]},{"id":"67c37949-2bd1-452a-95c9-1cc481f2c2f0","firstName":"Richard","lastName":"Bezanson","bio":"Richard works as a system administrator for Jordan School district.  Started with Novell Netware and that died.  Then there were too many windows guys so I worked my way in as an Apple guy.  I work primarily with google workspace and JAMF-School but I dabble in many other areas as part of ODAS.","tagLine":"Systems Admin","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[738851],"fullName":"Richard Bezanson","categoryItems":[],"questionAnswers":[]},{"id":"5bf31e4a-5659-4154-9020-6047761e4070","firstName":"Robert","lastName":"Dysart","bio":"25 Years at Davis Technical College as primary Systems support for Computing and Networking","tagLine":"Davis Technical College Systems Engineer","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[735523],"fullName":"Robert Dysart","categoryItems":[],"questionAnswers":[]},{"id":"23741f73-f17d-427d-8f3f-9879b76c8526","firstName":"Ryan ","lastName":"Wilcox","bio":"Republican - District 7\r\nCounty(ies) - Weber\r\nBegan Legislative Service - Served 2008-2014, January 1, 2021\r\nCommittees: \r\n   Business and Labor Interim Committee\r\n   Ethnic Studies Commission\r\n   Higher Education Appropriations Subcommittee\r\n   House Business and Labor Committee\r\n   House Law Enforcement and Criminal Justice Committee\r\n   House Rules Committee\r\n   Law Enforcement and Criminal Justice Interim Committee\r\n   Legislative Process Committee\r\n   Organized Crime Subcommittee\r\n   School Security Task Force","tagLine":"Utah State Representative","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[761627],"fullName":"Ryan Wilcox","categoryItems":[],"questionAnswers":[]},{"id":"666ee1c6-207f-4e7c-bf7e-1a55f4154de3","firstName":"S","lastName":"J","bio":"I care deeply about privacy, security, and helping people.","tagLine":"NONE","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[724987],"fullName":"S J","categoryItems":[],"questionAnswers":[]},{"id":"9868adf1-c460-4ad0-bde3-698c41f577d2","firstName":"Sam","lastName":"Moses","bio":"Moses has over 8 years of experience working in cyber security. From BYU, Moses earned a Bachelor of Information Technology and a Master of Technology, both with emphasis in Cyber Security. While in college, Moses worked in the Cyber Security Research Lab as the lab manager performing research and leading the student red team to perform penetration tests. Moses worked as the Senior Security Analyst and Team Lead in the CES Security Operation Center providing security services to multiple college institutions. Moses joined Rapid7's pentesting team over three years ago and works daily with clients to best define and meet their needs, test their systems, and communicate findings.","tagLine":"Rapid7 Security Consultant; Penetration Tester","profilePicture":"https://sessionize.com/image/4c6d-400o400o1-7j3YFUjbSCZpKsqdcyd6RE.jpg","isTopSpeaker":false,"links":[],"sessions":[698587],"fullName":"Sam Moses","categoryItems":[],"questionAnswers":[]},{"id":"e06b4e43-5e69-4d5e-ac91-12a0580b97f5","firstName":"Sean","lastName":"Valken-LeDuc","bio":"Sean Valken-LeDuc - Security Analyst - O.C. Tanner\r\n\r\nWorking as a security analyst since 9/22 after spending about 16 months at the Service Desk after working to transition to a career in IT with minimal prior formal technical experience or skills. \r\n\r\nCertifications - Security+, CCNA, CompTIA CySA+, AWS Certified Cloud Practitioner\r\n\r\nI have a 2 year old Great Pyreneese/Alaskan Malamute who's the love of my life and I enjoy taking her to the dog park and on hikes! ","tagLine":"Sean Valken-LeDuc - Security Analyst - O.C. Tanner","profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[699141],"fullName":"Sean Valken-LeDuc","categoryItems":[],"questionAnswers":[]},{"id":"8cf310cf-a644-4774-baa6-967628fee847","firstName":"Shawn","lastName":"Wallis","bio":"Head of Threat Management","tagLine":"Head of Threat Management","profilePicture":"https://sessionize.com/image/bc0a-400o400o1-DoZuWcuzNRWvoWNeGD7NWU.jpg","isTopSpeaker":false,"links":[],"sessions":[698940],"fullName":"Shawn Wallis","categoryItems":[],"questionAnswers":[]},{"id":"d1b0424c-fcff-484b-9002-3949725d4296","firstName":"Spencer","lastName":"Heywood","bio":"Unix systems engineer with a passion for automation, open source, privacy and security.\r\n\r\nMost of my interests and activity are on my GitHub: https://github.com/heywoodlh\r\n\r\nBlogging here: https://heywoodlh.io","tagLine":"Platform Engineer at MIT Lincoln Laboratory","profilePicture":"https://sessionize.com/image/8599-400o400o1-STxzYWPKn1ruK7FnxeUd5P.png","isTopSpeaker":false,"links":[],"sessions":[684506],"fullName":"Spencer Heywood","categoryItems":[],"questionAnswers":[]},{"id":"74ec89de-524b-4efb-9ef9-5b835ad9e26a","firstName":"Steve","lastName":"Christiaens","bio":"Steve Christiaens is an Application Security Architect at BambooHR. His role includes security consulting and architecture reviews and buildout of the information security program.\r\n\r\nPrior to joining BambooHR, Steve worked as a Senior Security Engineer at Qualtrics, leading the Vulnerability Management program as well as consulting on the security of new and existing product features. Before that he was a Senior Security Analyst at Bishop Fox, a security consulting firm providing IT security services to the Fortune 500, global financial institutions, and high-tech startups. Steve’s primary areas of expertise were application and wireless penetration testing. He also worked in the banking industry for five years in systems administration and fraud detection capacities.\r\n\r\nSteve holds a Master in Technology from Brigham Young University with a focus in Information Assurance and Security. He also holds a Bachelor of Science from BYU with a major in Information Technology and a focus in Security. He presented at ITAC 2015 on the subject of vulnerabilities found in Internet of Things devices and has spoken at Grey H@t at Georgia Tech regarding smart device exploits. While studying for his master’s degree, Steve led the red team at Brigham Young University’s Cyber Security Research Lab.\r\n\r\nSteve loves to make technology do things it was not designed to do. When not working, he likes hiking with his wife and 4 kids, board games, trying a new restaurant, drawing, or reading a great book.","tagLine":"Current Application Security Architect, background in Vuln Management and Pentesting","profilePicture":"https://sessionize.com/image/346e-400o400o1-Qo2unuVjmZ3jwQn3C41ydG.jpg","isTopSpeaker":false,"links":[],"sessions":[721569],"fullName":"Steve Christiaens","categoryItems":[],"questionAnswers":[]},{"id":"f6b9f974-e5d3-46f8-b8eb-5f69a8d8c0c7","firstName":"Steve","lastName":"Fink","bio":"Chief Information Security & Technology Officer\r\nPrincipal Architect for Black Hat Conferences\r\nSpeaker & Presenter –\r\nBlack Hat, RSAC, SaintCON, Bsides, ISACA, ISSA\r\nPresident DC918 (DefCon Groups)\r\nPast President ISACA Utah Chapter\r\nServed on the UtahSec Board of Directors\r\nServed on the 801 Labs Board of Directors\r\n34 years of computer networking experience\r\n24 years of information security experience\r\n\r\nDuring Fink’s 30+ year career he has evangelized architecting and deploying information systems to be the most secure possible. During Fink’s career as a penetration tester he has a 100% success rate of compromising the target. Fink’s detailed research into exploit design include things such as BadUSB, RFID, Dream Plug and the NSA-0day tools provides education to both the Information Security community as a whole and the companies that Secure Yeti works with to perform penetration testing services. Fink is also the Principal Architect for Black Hat conferences, architecting and protecting attendees on one of the most malicious networks on the planet.\r\n\r\nFink’s career with Information Systems began in 1986 repairing Apple II’s, and after leaving military service, Fink has excelled in the Information Security field with many hours spent in Research and Development keeping up with the ever-changing threat landscape in Information Systems and particularly sensitive data. \r\n","tagLine":"CISO/CTO - Secure Yeti","profilePicture":"https://sessionize.com/image/3930-400o400o1-Vh4KZ4X56brGChcottygdJ.jpg","isTopSpeaker":false,"links":[],"sessions":[725340],"fullName":"Steve Fink","categoryItems":[],"questionAnswers":[]},{"id":"042aa25f-e50d-4e85-9520-505f19833b7d","firstName":"Steven","lastName":"Wallace","bio":null,"tagLine":null,"profilePicture":null,"isTopSpeaker":false,"links":[],"sessions":[729454],"fullName":"Steven Wallace","categoryItems":[],"questionAnswers":[]},{"id":"69f81aa8-3c4e-4ae8-a494-acebba3aff73","firstName":"Tim","lastName":"Medin","bio":"Tim the the Founder and CEO of Red Siege Information Security. He is a former Senior Instructor and course author (SEC560: Enterprise Penetration Testing) at The SANS Institute. Through the course of his career, Tim has performed penetration tests on a wide range of organizations and technologies. Tim has gained information security experience in a variety of industries including previous positions in control systems, higher education, financial services, and manufacturing. Tim is an experienced international speaker, having presented to organizations around the world. Tim is the creator of the Kerberoasting, a widely utilized Red Team penetration test technique to extract kerberos tickets in order to offline attack the password of enterprise service accounts.","tagLine":"Red Siege Information Security Founder and CEO","profilePicture":"https://sessionize.com/image/59ff-400o400o1-JVTHvjDZzSug498thYWFah.png","isTopSpeaker":false,"links":[],"sessions":[724537],"fullName":"Tim Medin","categoryItems":[],"questionAnswers":[]},{"id":"96691be9-112a-4a46-95bd-6fba3eef6419","firstName":"Tom","lastName":"Pohl","bio":"Tom Pohl is a Principal Consultant and Penetration Testing Team Manager at LMG Security. Prior to LMG, he has spent most of his career on the blue team building and securing systems used by millions of people. And by night, he is a competitive CTF player and has won several black/gold badges including THOTCON, Circle City Con, Wild West Hackin’ Fest and DEF CON. He is good at what he does because he’s already made many of the mistakes that he encounters in client environments on a daily basis.","tagLine":"Principal Consultant and the Penetration Testing Team Manager at LMG Security","profilePicture":"https://sessionize.com/image/9eb0-400o400o1-sLkCuZDQmHzsdZTeE5LNmM.JPG","isTopSpeaker":false,"links":[],"sessions":[699427],"fullName":"Tom Pohl","categoryItems":[],"questionAnswers":[]},{"id":"76edcbf4-0215-492e-a6e9-0bd1fc8677d2","firstName":"Travis","lastName":"Floyd","bio":"Systems Engineer and Esports Commissioner for 5 years.  Penetration Tester for 10 years. BS and MS in Computer Science.","tagLine":"Systems Engineer, Esports Commissioner, Penetration Tester","profilePicture":"https://sessionize.com/image/88ca-400o400o1-4DfBYHZAPsFGW59DJbSzbB.jpg","isTopSpeaker":false,"links":[],"sessions":[720942],"fullName":"Travis Floyd","categoryItems":[],"questionAnswers":[]},{"id":"0d7120ab-8c6e-4374-aeeb-ef9caf080c9f","firstName":"Trent ","lastName":"Lo","bio":"Trent Lo is an accomplished cybersecurity professional, entrusted with the position of Director of Security Research at a global professional services firm. With a proven track record in defending Tier 1 Networks, Trent possesses a versatile background in offense and defense, enabling him to architect visionary security solutions for Fortune 500 companies. He is a recognized security researcher, having reported vulnerabilities in renowned organizations such as Zoom, Microsoft, Google, and Southwest Airlines. Leveraging his extensive industry relationships, Trent stays ahead of emerging threats and develops proactive strategies to protect organizations from cyber-attacks.","tagLine":null,"profilePicture":"https://sessionize.com/image/c749-400o400o1-L3gkUv5eVP1QY24FfbNzMH.png","isTopSpeaker":false,"links":[],"sessions":[737951],"fullName":"Trent Lo","categoryItems":[],"questionAnswers":[]},{"id":"1764f856-b76e-4437-b043-5c6e34b169b7","firstName":"Troy","lastName":"Jessup","bio":"Troy is the founder of SAINTCON, and well-respected cyber-security professional currently working in the public sector.","tagLine":"Jup1t3r","profilePicture":"https://sessionize.com/image/b736-400o400o1-nrj6f5V5Q6oS7jrrAy4nkt.png","isTopSpeaker":false,"links":[],"sessions":[735509,680860,729454,680858],"fullName":"Troy Jessup","categoryItems":[],"questionAnswers":[]},{"id":"51e0d54b-f082-4815-91f4-69587812f0da","firstName":"Troy","lastName":"Lunt","bio":"Enjoyed 25 years working for electronic commerce software development companies in the SF Bay and New York/Phil areas before joining Iron County School District in 2014.  Working with K-12 students and educators has become a very exciting and fulfilling experience.","tagLine":"Iron County School District - Technology Director & Data Privacy Manager","profilePicture":"https://sessionize.com/image/5049-400o400o1-nJzBaFt93x5N9nJMtBDsyD.jpg","isTopSpeaker":false,"links":[],"sessions":[735509,720942],"fullName":"Troy Lunt","categoryItems":[],"questionAnswers":[]}],"questions":[],"categories":[],"rooms":[{"id":47248,"name":"Main Track 1 (Ballroom A)","sort":0},{"id":47249,"name":"Main Track 2 (Ballroom B)","sort":1},{"id":47250,"name":"Main Track 3 (Ballroom C)","sort":2},{"id":53440,"name":"Event Floor (Expo Hall)","sort":3},{"id":53441,"name":"Chillout (Cascade A,B,&C)","sort":4},{"id":53442,"name":"The Lounge (Chillout Common Area)","sort":5},{"id":53443,"name":"3rd Floor","sort":6},{"id":53444,"name":"Community Classroom 1 (Expo Hall by HHC)","sort":7},{"id":55486,"name":"Community Classroom 2 (Expo Hall by Communities)","sort":8},{"id":53445,"name":"Education Community Track (Cascade E)","sort":9},{"id":53446,"name":"Community Track (Soldier Creek)","sort":10},{"id":53447,"name":"Registration (North Entry)","sort":11},{"id":53448,"name":"Store (Cafe on the 1st floor)","sort":12},{"id":53449,"name":"Hyatt Place Hotel","sort":13},{"id":55226,"name":"Breakouts (Hobble Creek)","sort":14}]}